Repository: tarikmanoar/vsCode-Extensions
Catalog: *-mssql.mssql-1.7.0/localization/xliff/fra/localizedPackage.json.fra.xlf
Languages: fr_fr

# extension.runQuery
source: Execute Query
fr_fr: Exécuter la requête

# extension.runCurrentStatement
source: Execute Current Statement
fr_fr: Exécuter l’instruction en cours

# extension.cancelQuery
source: Cancel Query
fr_fr: Annuler la requête

# extension.connect
source: Connect
fr_fr: Connexion

# extension.disconnect
source: Disconnect
fr_fr: Déconnecter

# extension.manageProfiles
source: Manage Connection Profiles
fr_fr: Gérer les profils de connexion

# extension.chooseDatabase
source: Use Database
fr_fr: Utiliser la base de données

# extension.chooseLanguageFlavor
source: Choose SQL handler for this file
fr_fr: Choisir SQL handler pour ce fichier

# extension.showGettingStarted
source: Getting Started Guide
fr_fr: Guide de démarrage

# extension.newQuery
source: New Query
fr_fr: Nouvelle requête

# extension.rebuildIntelliSenseCache
source: Refresh IntelliSense Cache
fr_fr: Actualiser le Cache IntelliSense

# mssql.logDebugInfo
source: [Optional] Log debug output to the VS Code console (Help -> Toggle Developer Tools)
fr_fr: [Facultatif] Loguer la sortie de débogage dans la console de VS Code (Aide -> Activer/Désactiver les outils de développement)

# mssql.maxRecentConnections
source: The maximum number of recently used connections to store in the connection list.
fr_fr: Le nombre maximal de connexions récemment utilisées à stocker dans la liste de connexion.

# mssql.connections
source: Connection profiles defined in 'User Settings' are shown under 'MS SQL: Connect' command in the command palette.
fr_fr: Les profils de connexion définis dans « Paramètres utilisateur » apparaissent sous la commande "MS SQL : Connect' dans la palette de commandes.

# mssql.connection.server
source: [Required] Specify the server name to connect to. Use 'hostname\\instance' or '<server>.database.windows.net' for Azure SQL Database.
fr_fr: [Obligatoire] Spécifie le nom du serveur auquel vous connecter. Utiliser 'hostname\\instance' ou '<server>. database.windows.net' pour une base de données SQL Azure.

# mssql.connection.database
source: [Optional] Specify the database name to connect to. If database is not specified, the default user database setting is used, typically 'master'.
fr_fr: [Facultatif] Spécifie le nom de base de données à laquelle se connecter à. Si la base de données n’est pas spécifiée, le paramètre de base de données de l’utilisateur par défaut est utilisée, généralement 'master'.

# mssql.connection.user
source: [Optional] Specify the user name for SQL Server authentication. If user name is not specified, when you connect, you will be asked again.
fr_fr: [Facultatif] Spécifie le nom d’utilisateur pour l’authentification SQL Server. Si le nom d’utilisateur n’est pas spécifié, lorsque vous vous connectez, on vous le demandera à nouveau.

# mssql.connection.password
source: [Optional] Specify the password for SQL Server authentication. If password is not specified or already saved, when you connect, you will be asked again.
fr_fr: [Facultatif] Spécifie le mot de passe pour l’authentification SQL Server. Si le mot de passe n’est pas spécifié ou déjà enregistré, lorsque vous vous connectez, on vous le demandera à nouveau.

# mssql.connection.authenticationType
source: [Optional] Specify the SQL Server authentication type.
fr_fr: [Facultatif] Spécifie le type d’authentification SQL Server.

# mssql.connection.port
source: [Optional] Specify the port number to connect to.
fr_fr: [Facultatif] Spécifie le numéro de port auquel se connecter.

# mssql.connection.encrypt
source: [Optional] When set to 'true', SQL Server uses SSL encryption for data sent between the client and the server if the server has a certificate installed. Set 'true' for Azure SQL Database connection.
fr_fr: [Facultatif] Lorsque la valeur est à 'true', SQL Server utilise le chiffrement SSL pour les données envoyées entre le client et le serveur si le serveur possède un certificat installé. Mettre la valeur à 'true' pour la connexion à une base de données SQL Azure.

# mssql.connection.trustServerCertificate
source: [Optional] When set to 'true', the SQL Server SSL certificate is automatically trusted when the communication layer is encrypted using SSL. Set 'false' for Azure SQL Database connection.
fr_fr: [Facultatif] Lorsque la valeur est à 'true', le certificat SSL SQL Server est automatiquement approuvé lorsque la couche de communication est chiffrée à l’aide de SSL. Mettre la valeur à 'false' pour la connexion à une base de données SQL Azure.

# mssql.connection.persistSecurityInfo
source: [Optional] When set to false, security-sensitive information, such as the password, is not returned as part of the connection if the connection is open or has ever been in an open state.
fr_fr: [Facultatif] Lorsque la valeur fausse, les informations de sécurité sensibles, telles que le mot de passe, ne sont pas retournées dans le cadre de la connexion si la connexion est ouverte ou a été dans un état ouvert.

# mssql.connection.connectTimeout
source: [Optional] Specify the length of time in seconds to wait for a connection to the server before it times out. The default timeout value for Azure SQL Database is 30.
fr_fr: [Facultatif] Spécifie la durée en secondes à attendre pour une connexion au serveur avant qu'elle n'arrive à expiration. La valeur de délai d’attente par défaut pour une base de données SQL Azure est 30.

# mssql.connection.connectRetryCount
source: [Optional] Specify the number of attempts to restore connection.
fr_fr: [Facultatif] Spécifie le nombre de tentatives pour restaurer la connexion.

# mssql.connection.connectRetryInterval
source: [Optional] Specify the delay between attempts to restore connection.
fr_fr: [Facultatif] Spécifie le délai entre deux tentatives pour restaurer la connexion.

# mssql.connection.workstationId
source: [Optional] Specify the name of the workstation connecting to SQL Server.
fr_fr: [Facultatif] Spécifie le nom de la station de travail se connectant à SQL Server.

# mssql.connection.applicationName
source: [Optional] Specify the name of the application used for SQL Server to log (default: 'vscode-mssql').
fr_fr: [Facultatif] Spécifie le nom de l'application utilisée par SQL Server pour loguer (par défaut : 'vscode-mssql').

# mssql.connection.applicationIntent
source: [Optional] Declares the application workload type when connecting to SQL Server such as ReadWrite or ReadOnly. Refer to SQL Server AlwaysOn for more detail.
fr_fr: [Facultatif] Définit le type de charge de travail d’application lors de la connexion à SQL Server comme ReadWrite ou ReadOnly. Reportez-vous à SQL Server AlwaysOn pour plus de détails.

# mssql.connection.currentLanguage
source: [Optional] Indicates the SQL Server language settings.
fr_fr: [Facultatif] Indique les paramètres du langage SQL Server.

# mssql.connection.pooling
source: [Optional] When set to 'true', the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool.
fr_fr: [Facultatif] Lorsque la valeur est 'true', l’objet de connexion est retiré du pool approprié, ou si nécessaire, est créé et ajouté au pool approprié.

# mssql.connection.maxPoolSize
source: [Optional] Specify the maximum number of connections allowed in the pool.
fr_fr: [Facultatif] Spécifie le nombre maximal de connexions autorisées dans le pool.

# mssql.connection.minPoolSize
source: [Optional] Specify the minimum number of connections allowed in the pool.
fr_fr: [Facultatif] Spécifie le nombre minimal de connexions autorisées dans le pool.

# mssql.connection.loadBalanceTimeout
source: [Optional] Specify the minimum amount of time in seconds for this connection to live in the pool before being removed/deleted.
fr_fr: [Facultatif] Spécifie la quantité minimale de temps en secondes pour la durée de vie de cette connexion dans le pool avant d’être supprimée.

# mssql.connection.replication
source: [Optional] Used by SQL Server in replication.
fr_fr: [Facultatif] Utilisé par SQL Server dans la réplication.

# mssql.connection.attachDbFilename
source: [Optional] Specify the name of the primary file, including the full path name, of an attachable database.
fr_fr: [Facultatif] Spécifie le nom du fichier primaire, y compris le nom de chemin d’accès complet, d’une base de données pouvant être attachée.

# mssql.connection.failoverPartner
source: [Optional] Specify the name or network address of the instance of SQL Server that acts as a failover partner.
fr_fr: [Facultatif] Spécifie le nom ou l’adresse réseau de l’instance de SQL Server qui agit comme un partenaire de basculement (failover).

# mssql.connection.multiSubnetFailover
source: [Optional] When set to 'true', the detection and connection to the active server is faster if AlwaysOn Availability Group is configured on different subnets.
fr_fr: [Facultatif] Lorsque la valeur est à 'true', la détection et la connexion au serveur active est plus rapide si le groupe de disponibilité AlwaysOn est configuré sur des sous-réseaux différents.

# mssql.connection.multipleActiveResultSets
source: [Optional] When set to 'true', multiple result sets can be returned and read from on connection.
fr_fr: [Facultatif] Lorsque la valeur est à 'true', plusieurs ensembles de résultats peuvent être retournés et lire sur la connexion.

# mssql.connection.packetSize
source: [Optional] Specify the size in bytes of the network packets to communicate with SQL Server.
fr_fr: [Facultatif] Spécifie la taille en octets des paquets réseau pour communiquer avec SQL Server.

# mssql.connection.typeSystemVersion
source: [Optional] Indicates which server type the provider will expose through the DataReader.
fr_fr: [Facultatif] Indique quel type de serveur le fournisseur exposera à travers l’objet DataReader.

# mssql.connection.connectionString
source: [Optional] The ADO.NET connection string to use for the connection. Overrides any other options given in this connection.
fr_fr: [Facultatif] La chaîne de connexion ADO.NET à utiliser pour la connexion. Remplace toutes les autres options données dans cette connexion.

# mssql.connection.profileName
source: [Optional] Specify a custom name for this connection profile to easily browse and search in the command palette of Visual Studio Code.
fr_fr: [Facultatif] Spécifie un nom personnalisé pour ce profil de connexion afin de naviguer facilement et de rechercher dans la palette de commandes de Visual Studio Code.

# mssql.connection.savePassword
source: [Optional] When set to 'true', the password for SQL Server authentication is saved in the secure store of your operating system such as KeyChain in MacOS or Secure Store in Windows.
fr_fr: [Facultatif] Lorsque la valeur est à 'true', le mot de passe pour l’authentification SQL Server est enregistré dans le magasin sécurisé de votre système d’exploitation tels que KeyChain sous MacOS ou Secure Store sous Windows.

# mssql.connection.emptyPasswordInput
source: [Optional] Indicates whether this profile has an empty password explicitly set
fr_fr: [Facultatif] Indique si ce profil a un mot de passe vide défini explicitement

# mssql.shortcuts
source: Shortcuts related to the results window
fr_fr: Raccourcis associés à la fenêtre de résultats

# mssql.messagesDefaultOpen
source: True for the messages pane to be open by default; false for closed
fr_fr: True pour ouvrir le volet de messages par défaut; false pour le fermer

# mssql.resultsFontFamily
source: Set the font family for the results grid; set to blank to use the editor font
fr_fr: Définit la famille de la police de caractères pour la grille de résultats; laisser vide pour utiliser la police de l’éditeur

# mssql.resultsFontSize
source: Set the font size for the results grid; set to blank to use the editor size
fr_fr: Définit la taille de la police pour la grille de résultats ; laisser vide pour utiliser la taille de l’éditeur

# mssql.saveAsCsv.includeHeaders
source: [Optional] When true, column headers are included when saving results as CSV
fr_fr: [Facultatif] Lorsque la valeur est true, les en-têtes de colonnes sont inclus lors de l’enregistrement des résultats en CSV

# mssql.copyIncludeHeaders
source: [Optional] Configuration options for copying results from the Results View
fr_fr: [Facultatif] Options de configuration pour la copie des résultats à partir de la Vue Résultats

# mssql.copyRemoveNewLine
source: [Optional] Configuration options for copying multi-line results from the Results View
fr_fr: [Facultatif] Options de configuration pour la copie de résultats multi-lignes depuis la vue Résultats

# mssql.showBatchTime
source: [Optional] Should execution time be shown for individual batches
fr_fr: [Facultatif] Définit si le temps d’exécution doit être indiqué pour les lots individuels

# mssql.splitPaneSelection
source: [Optional] Configuration options for which column new result panes should open in
fr_fr: [Facultatif] Options de configuration pour définir la colonne dans laquelle les nouveaux volets de résultat devraient être ouverts

# mssql.format.alignColumnDefinitionsInColumns
source: Should column definitions be aligned?
fr_fr: Spécifie si les définitions de colonne doivent être alignées

# mssql.format.datatypeCasing
source: Should data types be formatted as UPPERCASE, lowercase, or none (not formatted)
fr_fr: Spécifie si les types de données doivent être formatés en MAJUSCULES, minuscules, ou non formatés

# mssql.format.keywordCasing
source: Should keywords be formatted as UPPERCASE, lowercase, or none (not formatted)
fr_fr: Spécifie si les mots-clés doivent être formatés en majuscules, minuscules ou non formatés

# mssql.format.placeCommasBeforeNextStatement
source: should commas be placed at the beginning of each statement in a list e.g. ', mycolumn2' instead of at the end e.g. 'mycolumn1,'
fr_fr: Spécifie si les virgules doivent être placées au début de chaque instruction dans une liste (par exemple: ',mycolumn2') plutôt qu’à la fin (par exemple: 'mycolumn1',)

# mssql.format.placeSelectStatementReferencesOnNewLine
source: Should references to objects in a select statements be split into separate lines? E.g. for 'SELECT C1, C2 FROM T1' both C1 and C2 will be on separate lines
fr_fr: Spécifie si les références à des objets dans des instructions select devraient être répartis sur plusieurs lignes ? Par exemple pour 'SELECT C1, C2 FROM T1', C1 et C2 seront sur des lignes distinctes

# mssql.applyLocalization
source: [Optional] Configuration options for localizing into VSCode's configured locale (must restart VSCode for settings to take effect)
fr_fr: [Facultatif] Options de configuration pour la localisation dans les paramètres régionaux configurés dans VSCode (vous devez redémarrer VSCode pour que les paramètres soient pris en compte)

# mssql.query.displayBitAsNumber
source: Should BIT columns be displayed as numbers (1 or 0)? If false, BIT columns will be displayed as 'true' or 'false'
fr_fr: Spécifie si le Colonnes BIT doivent être affichées sous forme de nombre (1 ou 0). Si false, les colonnes BIT seront affichées sous la forme 'true' ou 'false'

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
fr_fr: Spécifie si l'IntelliSense doit être activé

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
fr_fr: Spécifie si la vérification des erreurs IntelliSense doit être activée

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
fr_fr: Spécifie si les suggestions IntelliSense doivent être activées

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
fr_fr: Spécifie si les infos rapides IntelliSense doivent être activées

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
fr_fr: Spécifie si les suggestions IntelliSense doivent être en minuscules
