Repository: tarikmanoar/vsCode-Extensions
Catalog: *-mssql.mssql-1.7.0/localization/xliff/esn/localizedPackage.json.esn.xlf
Languages: es_es

# extension.runQuery
source: Execute Query
es_es: Ejecutar la consulta

# extension.runCurrentStatement
source: Execute Current Statement
es_es: Ejecutar la instrucción actual

# extension.cancelQuery
source: Cancel Query
es_es: Cancelar consulta

# extension.connect
source: Connect
es_es: Conectar

# extension.disconnect
source: Disconnect
es_es: Desconectar

# extension.manageProfiles
source: Manage Connection Profiles
es_es: Administrar perfiles de conexión

# extension.chooseDatabase
source: Use Database
es_es: Utilizar base de datos

# extension.chooseLanguageFlavor
source: Choose SQL handler for this file
es_es: Seleccione el manejador SQL para este archivo

# extension.showGettingStarted
source: Getting Started Guide
es_es: Guía introductoria

# extension.newQuery
source: New Query
es_es: Nueva consulta

# extension.rebuildIntelliSenseCache
source: Refresh IntelliSense Cache
es_es: Actualizar Cache de IntelliSense

# mssql.logDebugInfo
source: [Optional] Log debug output to the VS Code console (Help -> Toggle Developer Tools)
es_es: [Opcional] Registrar los resultados de depuración a la consola de VS Code (ayuda-> Interruptor de herramientas de desarrollo)

# mssql.maxRecentConnections
source: The maximum number of recently used connections to store in the connection list.
es_es: El número máximo de conexiones recientemente utilizadas para almacenar en la lista de conexiones.

# mssql.connections
source: Connection profiles defined in 'User Settings' are shown under 'MS SQL: Connect' command in the command palette.
es_es: Los perfiles de conexión definidos en 'Configuración de usuario' se muestran bajo el comando ' MS SQL: Conect' en la paleta de comandos.

# mssql.connection.server
source: [Required] Specify the server name to connect to. Use 'hostname\\instance' or '<server>.database.windows.net' for Azure SQL Database.
es_es: [Obligatorio] Especificar el nombre del servidor para conectarse. Utilizar 'nombredehost\\instancia' o '<server>.database.windows.net' para una base de datos de SQL Azure.

# mssql.connection.database
source: [Optional] Specify the database name to connect to. If database is not specified, the default user database setting is used, typically 'master'.
es_es: [Opcional] Especifique el nombre de la base de datos para conectarse. Si no se especifica la base de datos, se utiliza la configuración de la base de datos de usuario predeterminada, típicamente 'master'.

# mssql.connection.user
source: [Optional] Specify the user name for SQL Server authentication. If user name is not specified, when you connect, you will be asked again.
es_es: [Opcional] Especifique el nombre de usuario para la autenticación de SQL Server. Si no se especifica nombre de usuario, cuando se conecte se le pedirá otra vez.

# mssql.connection.password
source: [Optional] Specify the password for SQL Server authentication. If password is not specified or already saved, when you connect, you will be asked again.
es_es: [Opcional] Especifique la contraseña para la autenticación de SQL Server. Si la contraseña no se especifica o ya está guarda, cuando se conecte se le pedirá otra vez.

# mssql.connection.authenticationType
source: [Optional] Specify the SQL Server authentication type.
es_es: Especifica el tipo de autenticación para SQL Server.

# mssql.connection.port
source: [Optional] Specify the port number to connect to.
es_es: [Opcional] Especificar el número de puerto para conectarse.

# mssql.connection.encrypt
source: [Optional] When set to 'true', SQL Server uses SSL encryption for data sent between the client and the server if the server has a certificate installed. Set 'true' for Azure SQL Database connection.
es_es: [Opcional] Cuando está establecido en 'true', SQL Server utiliza encriptación SSL para los datos enviados entre el cliente y el servidor si el servidor tiene un certificado instalado. Establecer 'true' para la conexión de base de datos de SQL Azure.

# mssql.connection.trustServerCertificate
source: [Optional] When set to 'true', the SQL Server SSL certificate is automatically trusted when the communication layer is encrypted using SSL. Set 'false' for Azure SQL Database connection.
es_es: [Opcional] Cuando está establecido en 'true', el certificado SSL del servidor SQL es automáticamente considerado de confianza cuando la capa de la comunicación está cifrada mediante SSL. Configurar como 'false' para la conexión de base de datos de SQL Azure.

# mssql.connection.persistSecurityInfo
source: [Optional] When set to false, security-sensitive information, such as the password, is not returned as part of the connection if the connection is open or has ever been in an open state.
es_es: [Opcional] Cuando se establece como 'false', la información crítica respecto a la seguridad, como la contraseña, no se devuelve como parte de la conexión si la conexión está abierta o alguna vez ha estado en un estado abierto.

# mssql.connection.connectTimeout
source: [Optional] Specify the length of time in seconds to wait for a connection to the server before it times out. The default timeout value for Azure SQL Database is 30.
es_es: [Opcional] Especificar la cantidad de tiempo en segundos durante la que se espera una conexión al servidor antes de que caduque el tiempo de espera. El valor de tiempo de espera predeterminado para la base de datos de SQL Azure es 30.

# mssql.connection.connectRetryCount
source: [Optional] Specify the number of attempts to restore connection.
es_es: [Opcional] Especificar el número de intentos para restablecer la conexión.

# mssql.connection.connectRetryInterval
source: [Optional] Specify the delay between attempts to restore connection.
es_es: [Opcional] Especifique el retardo entre intentos de restablecer la conexión.

# mssql.connection.workstationId
source: [Optional] Specify the name of the workstation connecting to SQL Server.
es_es: [Opcional] Especifique el nombre de la estación de trabajo que se conecta a SQL Server.

# mssql.connection.applicationName
source: [Optional] Specify the name of the application used for SQL Server to log (default: 'vscode-mssql').
es_es: [Opcional] Especifique el nombre de la aplicación utilizada por SQL.

# mssql.connection.applicationIntent
source: [Optional] Declares the application workload type when connecting to SQL Server such as ReadWrite or ReadOnly. Refer to SQL Server AlwaysOn for more detail.
es_es: [Opcional] Declara el tipo de carga de trabajo de aplicación cuando se conecta a SQL Server tal como ReadWrite o ReadOnly. Para más detalles, consulte SQL Server AlwaysOn.

# mssql.connection.currentLanguage
source: [Optional] Indicates the SQL Server language settings.
es_es: [Opcional] Indica la configuración de idioma de SQL Server.

# mssql.connection.pooling
source: [Optional] When set to 'true', the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool.
es_es: [Opcional] Cuando está establecido en 'true', el objeto connection se extrae del grupo de conexiones adecuado o, si es necesario, se crea y se agrega al grupo apropiado.

# mssql.connection.maxPoolSize
source: [Optional] Specify the maximum number of connections allowed in the pool.
es_es: [Opcional] Especificar el número máximo de conexiones permitidas en el grupo de conexiones.

# mssql.connection.minPoolSize
source: [Optional] Specify the minimum number of connections allowed in the pool.
es_es: [Opcional] Especificar el número mínimo de conexiones permitidas en el grupo de conexiones.

# mssql.connection.loadBalanceTimeout
source: [Optional] Specify the minimum amount of time in seconds for this connection to live in the pool before being removed/deleted.
es_es: [Opcional] Especificar la cantidad mínima de tiempo de vida de la conexión dentro del grupo, en segundos, antes de ser eliminada o borrada.

# mssql.connection.replication
source: [Optional] Used by SQL Server in replication.
es_es: [Opcional] Utilizada por SQL Server en la replicación.

# mssql.connection.attachDbFilename
source: [Optional] Specify the name of the primary file, including the full path name, of an attachable database.
es_es: [Opcional] Especifique el nombre del archivo principal, incluyendo la ruta de acceso completa, de una base de datos adjuntable.

# mssql.connection.failoverPartner
source: [Optional] Specify the name or network address of the instance of SQL Server that acts as a failover partner.
es_es: [Opcional] Especificar el nombre o dirección de red de la instancia de SQL Server que actúa como socio de conmutación por error.

# mssql.connection.multiSubnetFailover
source: [Optional] When set to 'true', the detection and connection to the active server is faster if AlwaysOn Availability Group is configured on different subnets.
es_es: [Opcional] Cuando se establece en 'true', la detección y conexión con el servidor activo es más rápida si el grupo de disponibilidad de AlwaysOn está configurado en diferentes subredes.

# mssql.connection.multipleActiveResultSets
source: [Optional] When set to 'true', multiple result sets can be returned and read from on connection.
es_es: [Opcional] Cuando se establece en 'true', se pueden devolver y leer múltiples conjuntos de resultados a través de la conexión.

# mssql.connection.packetSize
source: [Optional] Specify the size in bytes of the network packets to communicate with SQL Server.
es_es: [Opcional] Especifique el tamaño en bytes de los paquetes de red para comunicarse con SQL Server.

# mssql.connection.typeSystemVersion
source: [Optional] Indicates which server type the provider will expose through the DataReader.
es_es: [Opcional] Indica qué tipo de servidor expondrá el proveedor a través del DataReader.

# mssql.connection.connectionString
source: [Optional] The ADO.NET connection string to use for the connection. Overrides any other options given in this connection.
es_es: [Opcional] La cadena de conexión ADO.NET que se utilizará para la conexión. Reemplaza cualesquiera otras opciones establecidas en esta conexión.

# mssql.connection.profileName
source: [Optional] Specify a custom name for this connection profile to easily browse and search in the command palette of Visual Studio Code.
es_es: [Opcional] Especificar un nombre personalizado para este perfil de conexión para navegar fácilmente y buscar en la paleta de comandos de Visual Studio Code.

# mssql.connection.savePassword
source: [Optional] When set to 'true', the password for SQL Server authentication is saved in the secure store of your operating system such as KeyChain in MacOS or Secure Store in Windows.
es_es: [Opcional] Cuando se establece en 'true', la contraseña para autenticación de SQL Server se guarda en el almacén seguro de su sistema operativo tal como KeyChain en MacOS o Secure Store en Windows.

# mssql.connection.emptyPasswordInput
source: [Optional] Indicates whether this profile has an empty password explicitly set
es_es: [Opcional] Indica si este perfil tiene una contraseña vacía establecida explícitamente

# mssql.shortcuts
source: Shortcuts related to the results window
es_es: Accesos directos relacionados con la ventana de resultados

# mssql.messagesDefaultOpen
source: True for the messages pane to be open by default; false for closed
es_es: True para que el panel de mensajes esté abierto de forma predeterminada; false para que esté cerrado

# mssql.resultsFontFamily
source: Set the font family for the results grid; set to blank to use the editor font
es_es: Establece la familia de fuentes para la grilla de resultados; dejarlo en blanco para usar la fuente del editor

# mssql.resultsFontSize
source: Set the font size for the results grid; set to blank to use the editor size
es_es: Establecer el tamaño de fuente para la grilla de resultados; Dejar en blanco para utilizar el tamaño del editor

# mssql.saveAsCsv.includeHeaders
source: [Optional] When true, column headers are included when saving results as CSV
es_es: [Opcional] Cuando se esteblece en true, los encabezados de columna se incluyen al guardar resultados como CSV

# mssql.copyIncludeHeaders
source: [Optional] Configuration options for copying results from the Results View
es_es: [Opcional] Opciones de configuración para copiar resultados desde la vista de resultados

# mssql.copyRemoveNewLine
source: [Optional] Configuration options for copying multi-line results from the Results View
es_es: [Opcional] Opciones de configuración para copiar resultados de varias líneas desde la vista de resultados

# mssql.showBatchTime
source: [Optional] Should execution time be shown for individual batches
es_es: [Opcional] Si el tiempo de ejecución se mostrará para lotes individuales

# mssql.splitPaneSelection
source: [Optional] Configuration options for which column new result panes should open in
es_es: [Opcional] Opciones de configuración para en cual columna se deben abrir los nuevos páneles de resultados

# mssql.format.alignColumnDefinitionsInColumns
source: Should column definitions be aligned?
es_es: ¿Se deben alinear las definiciones de columna?

# mssql.format.datatypeCasing
source: Should data types be formatted as UPPERCASE, lowercase, or none (not formatted)
es_es: Los tipos de dato deben ser formateados como MAYÚSCULAS, minúsculas, o ninguno (sin formato)

# mssql.format.keywordCasing
source: Should keywords be formatted as UPPERCASE, lowercase, or none (not formatted)
es_es: Las palabras clave deben tener formato como MAYÚSCULAS, minúsculas, o ninguno (sin formato)

# mssql.format.placeCommasBeforeNextStatement
source: should commas be placed at the beginning of each statement in a list e.g. ', mycolumn2' instead of at the end e.g. 'mycolumn1,'
es_es: Las comas deben colocarse al principio de cada frase en una lista por ejemplo, ', mycolumn2' en vez de al final por ejemplo, 'mycolumn1',

# mssql.format.placeSelectStatementReferencesOnNewLine
source: Should references to objects in a select statements be split into separate lines? E.g. for 'SELECT C1, C2 FROM T1' both C1 and C2 will be on separate lines
es_es: ¿Deben dividirse las referencias a objetos en en sentencias select en líneas separadas? Por ejemplo, para 'SELECT C1, C2 FROM T1' C1 y C2 estarán en líneas separadas

# mssql.applyLocalization
source: [Optional] Configuration options for localizing into VSCode's configured locale (must restart VSCode for settings to take effect)
es_es: [Opcional] Opciones de configuración para localización en la configuración regional configurada en VSCode (debe reiniciar VSCode para que la configuración surta efecto)

# mssql.query.displayBitAsNumber
source: Should BIT columns be displayed as numbers (1 or 0)? If false, BIT columns will be displayed as 'true' or 'false'
es_es: ¿Se deben mostrar las columnas BIT como números (1 o 0)? Si es false, las columnas BIT se mostrarán como 'true' o 'false'

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
es_es: Debe habilitar IntelliSense

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
es_es: Debe habilitar la comprobación de errores de IntelliSense

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
es_es: Debe habilitar las sugerencias de IntelliSense

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
es_es: Debe habilitar la información rápida de IntelliSense

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
es_es: Las sugerencias de IntelliSense debe estar en minúsculas
