Repository: tarikmanoar/vsCode-Extensions
Catalog: *-mssql.mssql-1.7.0/localization/xliff/ita/localizedPackage.json.ita.xlf
Languages: it_it

# extension.runQuery
source: Execute Query
it_it: Esegui Query

# extension.runCurrentStatement
source: Execute Current Statement
it_it: Esegui l'istruzione corrente

# extension.cancelQuery
source: Cancel Query
it_it: Annulla Query

# extension.connect
source: Connect
it_it: Connetti

# extension.disconnect
source: Disconnect
it_it: Disconnetti

# extension.manageProfiles
source: Manage Connection Profiles
it_it: Gestire i profili di connessione

# extension.chooseDatabase
source: Use Database
it_it: Utilizza Database

# extension.chooseLanguageFlavor
source: Choose SQL handler for this file
it_it: Scegliere il gestore SQL per questo file

# extension.showGettingStarted
source: Getting Started Guide
it_it: Guida introduttiva

# extension.newQuery
source: New Query
it_it: Nuova query

# extension.rebuildIntelliSenseCache
source: Refresh IntelliSense Cache
it_it: Aggiorna la cache IntelliSense

# mssql.logDebugInfo
source: [Optional] Log debug output to the VS Code console (Help -> Toggle Developer Tools)
it_it: [Facoltativo] Registra l'output di debug nella console di VS Code (Aiuto -> Abilita Strumenti Sviluppo)

# mssql.maxRecentConnections
source: The maximum number of recently used connections to store in the connection list.
it_it: Il numero massimo di connessioni utilizzate di recente da memorizzare nell'elenco connessioni.

# mssql.connections
source: Connection profiles defined in 'User Settings' are shown under 'MS SQL: Connect' command in the command palette.
it_it: I profili di connessione definiti in 'Impostazioni utente' sono mostrati sotto il comando 'MS SQL: Connect'.

# mssql.connection.server
source: [Required] Specify the server name to connect to. Use 'hostname\\instance' or '<server>.database.windows.net' for Azure SQL Database.
it_it: [Obbligatorio] Specificare il nome del server a cui connettersi. Utilizzare 'hostname\\instance' o ' <server>. database.windows.net' per Azure SQL Database.

# mssql.connection.database
source: [Optional] Specify the database name to connect to. If database is not specified, the default user database setting is used, typically 'master'.
it_it: [Facoltativo] Specificare il nome del database a cui connettersi. Se il database non è specificato, verrà utilizzata l'impostazione predefinita del database utente, tipicamente 'master'.

# mssql.connection.user
source: [Optional] Specify the user name for SQL Server authentication. If user name is not specified, when you connect, you will be asked again.
it_it: [Facoltativo] Specificare il nome utente per l'autenticazione di SQL Server. Se il nome utente non è specificato verrà chiesto nuovamente al momento della connessione.

# mssql.connection.password
source: [Optional] Specify the password for SQL Server authentication. If password is not specified or already saved, when you connect, you will be asked again.
it_it: [Facoltativo] Specificare la password per l'autenticazione di SQL Server. Se non è specificata o già salvata, verrà richiesta alla connessione.

# mssql.connection.authenticationType
source: [Optional] Specify the SQL Server authentication type.
it_it: [Facoltativo] Specifica il tipo di autenticazione di SQL Server.

# mssql.connection.port
source: [Optional] Specify the port number to connect to.
it_it: [Facoltativo] Specificare il numero di porta a cui connettersi.

# mssql.connection.encrypt
source: [Optional] When set to 'true', SQL Server uses SSL encryption for data sent between the client and the server if the server has a certificate installed. Set 'true' for Azure SQL Database connection.
it_it: [Facoltativo] Quando impostato a 'true', SQL Server utilizza la crittografia SSL per i dati inviati tra il client e il server se il server ha un certificato installato. Impostare a 'true' per le connessioni a Azure SQL Database.

# mssql.connection.trustServerCertificate
source: [Optional] When set to 'true', the SQL Server SSL certificate is automatically trusted when the communication layer is encrypted using SSL. Set 'false' for Azure SQL Database connection.
it_it: [Facoltativo] Quando impostato a 'true', il certificato SSL di SQL Server viene automaticamente considerato attendibile quando il livello di comunicazione è crittografato tramite SSL. Impostare 'false' per la connessione al Azure SQL Database.

# mssql.connection.persistSecurityInfo
source: [Optional] When set to false, security-sensitive information, such as the password, is not returned as part of the connection if the connection is open or has ever been in an open state.
it_it: [Facoltativo] Se impostato a 'false', le informazioni riservate, come ad esempio la password, non saranno restituite come parte della connessione, se la connessione è aperta o è già stata in uno stato aperto.

# mssql.connection.connectTimeout
source: [Optional] Specify the length of time in seconds to wait for a connection to the server before it times out. The default timeout value for Azure SQL Database is 30.
it_it: [Facoltativo] Specificare l'intervallo di tempo di attesa in secondi per una connessione al server prima del timeout. Il valore di timeout predefinito per il Azure SQL Database è 30.

# mssql.connection.connectRetryCount
source: [Optional] Specify the number of attempts to restore connection.
it_it: [Facoltativo] Specifica il numero di tentativi di ripristino della connessione.

# mssql.connection.connectRetryInterval
source: [Optional] Specify the delay between attempts to restore connection.
it_it: [Facoltativo] Specifica il tempo di attesa tra i tentativi di ripristino della connessione.

# mssql.connection.workstationId
source: [Optional] Specify the name of the workstation connecting to SQL Server.
it_it: [Facoltativo] Specifica il nome della workstation connessa a SQL Server.

# mssql.connection.applicationName
source: [Optional] Specify the name of the application used for SQL Server to log (default: 'vscode-mssql').
it_it: [Facoltativo] Specifica il nome dell'applicazione utilizzata da SQL Server per fare log (impostazione predefinita: 'vscode-mssql').

# mssql.connection.applicationIntent
source: [Optional] Declares the application workload type when connecting to SQL Server such as ReadWrite or ReadOnly. Refer to SQL Server AlwaysOn for more detail.
it_it: [Facoltativo] Dichiara il tipo di carico di lavoro dell'applicazione quando ci si connette a SQL Server, come ReadWrite o ReadOnly. Per maggiori dettagli, fare riferimento a SQL Server AlwaysOn.

# mssql.connection.currentLanguage
source: [Optional] Indicates the SQL Server language settings.
it_it: [Facoltativo] Indica le impostazioni di lingua di SQL Server.

# mssql.connection.pooling
source: [Optional] When set to 'true', the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool.
it_it: [Facoltativo] Quando impostato a 'true', l'oggetto connection viene estratto dal pool appropriato, o, se necessario, viene creato e aggiunto al pool appropriato.

# mssql.connection.maxPoolSize
source: [Optional] Specify the maximum number of connections allowed in the pool.
it_it: [Facoltativo] Specifica il numero massimo di connessioni consentite nel pool.

# mssql.connection.minPoolSize
source: [Optional] Specify the minimum number of connections allowed in the pool.
it_it: [Facoltativo] Specifica il numero minimo di connessioni consentite nel pool.

# mssql.connection.loadBalanceTimeout
source: [Optional] Specify the minimum amount of time in seconds for this connection to live in the pool before being removed/deleted.
it_it: [Facoltativo] Specifica la quantità minima di tempo in secondi per la persistenza della connessione nel pool prima che essa sia rimossa o eliminata.

# mssql.connection.replication
source: [Optional] Used by SQL Server in replication.
it_it: [Facoltativo] Utilizzato da SQL Server nella replica.

# mssql.connection.attachDbFilename
source: [Optional] Specify the name of the primary file, including the full path name, of an attachable database.
it_it: [Facoltativo] Specifica il nome del file primario, comprensivo di percorso completo, di un database collegabile.

# mssql.connection.failoverPartner
source: [Optional] Specify the name or network address of the instance of SQL Server that acts as a failover partner.
it_it: [Facoltativo] Specifica il nome o indirizzo di rete dell'istanza di SQL Server che agisce come un partner di failover.

# mssql.connection.multiSubnetFailover
source: [Optional] When set to 'true', the detection and connection to the active server is faster if AlwaysOn Availability Group is configured on different subnets.
it_it: [Facoltativo] Quando impostato a 'true', il rilevamento e la connessione al server attivo è più veloce se si configura in sottoreti diverse l'AlwaysOn Availability Group.

# mssql.connection.multipleActiveResultSets
source: [Optional] When set to 'true', multiple result sets can be returned and read from on connection.
it_it: [Facoltativo] Quando impostato a 'true', result set multipli possono essere restituiti e letti sulla connessione.

# mssql.connection.packetSize
source: [Optional] Specify the size in bytes of the network packets to communicate with SQL Server.
it_it: [Facoltativo] Specifica la dimensione in byte dei pacchetti di rete per comunicare con SQL Server.

# mssql.connection.typeSystemVersion
source: [Optional] Indicates which server type the provider will expose through the DataReader.
it_it: [Facoltativo] Indica quale tipo di server il provider esporrà mediante l'oggetto DataReader.

# mssql.connection.connectionString
source: [Optional] The ADO.NET connection string to use for the connection. Overrides any other options given in this connection.
it_it: [Facoltativo] La stringa di connessione ADO.NET da utilizzare per la connessione. Esegue l'override di qualsiasi altra opzione impostata per la connessione.

# mssql.connection.profileName
source: [Optional] Specify a custom name for this connection profile to easily browse and search in the command palette of Visual Studio Code.
it_it: [Facoltativo] Specifica un nome personalizzato di profilo di connessione per facilitare la navigazione e la ricerca nella tavolozza comandi di Visual Studio Code.

# mssql.connection.savePassword
source: [Optional] When set to 'true', the password for SQL Server authentication is saved in the secure store of your operating system such as KeyChain in MacOS or Secure Store in Windows.
it_it: [Facoltativo] Quando impostato a 'true', la password per l'autenticazione di SQL Server viene salvata nell'archivio protetto del sistema operativo come ad esempio nel portachiavi di MacOS o nel Secure Store di Windows.

# mssql.connection.emptyPasswordInput
source: [Optional] Indicates whether this profile has an empty password explicitly set
it_it: [Facoltativo] Indica se questo profilo ha una password vuota impostata in modo esplicito

# mssql.shortcuts
source: Shortcuts related to the results window
it_it: Collegamenti correlati alla finestra dei risultati

# mssql.messagesDefaultOpen
source: True for the messages pane to be open by default; false for closed
it_it: True per aprire di default il riquadro messaggi; false per non aprirlo

# mssql.resultsFontFamily
source: Set the font family for the results grid; set to blank to use the editor font
it_it: Imposta la famiglia di caratteri per la griglia dei risultati; lasciare vuoto per utilizzare il font editor

# mssql.resultsFontSize
source: Set the font size for the results grid; set to blank to use the editor size
it_it: Imposta la dimensione del carattere per la griglia dei risultati; lasciare vuoto per utilizzare l'editor delle dimensioni

# mssql.saveAsCsv.includeHeaders
source: [Optional] When true, column headers are included when saving results as CSV
it_it: [Facoltativo] Quando è 'true', le intestazioni di colonna sono incluse quando si salvano i risultati come file CSV

# mssql.copyIncludeHeaders
source: [Optional] Configuration options for copying results from the Results View
it_it: [Facoltativo] Opzioni di configurazione per copiare i risultati dalla vista dei risultati

# mssql.copyRemoveNewLine
source: [Optional] Configuration options for copying multi-line results from the Results View
it_it: [Facoltativo] Opzioni di configurazione per la copia di risultati multi linea dalla vista dei risultati

# mssql.showBatchTime
source: [Optional] Should execution time be shown for individual batches
it_it: [Facoltativo] Il tempo di esecuzione deve essere mostrato per singoli batch?

# mssql.splitPaneSelection
source: [Optional] Configuration options for which column new result panes should open in
it_it: [Facoltativo] Opzioni di configurazione per determinare per quale colonna i nuovi riquadri risultato dovrebbero essere aperti

# mssql.format.alignColumnDefinitionsInColumns
source: Should column definitions be aligned?
it_it: Le definizioni di colonna devono essere allineate?

# mssql.format.datatypeCasing
source: Should data types be formatted as UPPERCASE, lowercase, or none (not formatted)
it_it: I tipi di dato devono essere formattati come maiuscole, minuscole, o nessuno (non formattato)?

# mssql.format.keywordCasing
source: Should keywords be formatted as UPPERCASE, lowercase, or none (not formatted)
it_it: Le parole chiave devono essere formattate come maiuscole, minuscole, o nessuno (non formattato)?

# mssql.format.placeCommasBeforeNextStatement
source: should commas be placed at the beginning of each statement in a list e.g. ', mycolumn2' instead of at the end e.g. 'mycolumn1,'
it_it: Le virgole devono essere collocate all'inizio di ogni istruzione in una lista, ad esempio ', mycolumn2' anziché alla fine, ad esempio 'mycolumn1,'?

# mssql.format.placeSelectStatementReferencesOnNewLine
source: Should references to objects in a select statements be split into separate lines? E.g. for 'SELECT C1, C2 FROM T1' both C1 and C2 will be on separate lines
it_it: I riferimenti agli oggetti in istruzioni select dovrebbero essere suddivisi in righe separate? Ad esempio per 'SELECT C1, C2 FROM T1' sia C1 che C2 saranno su righe diverse

# mssql.applyLocalization
source: [Optional] Configuration options for localizing into VSCode's configured locale (must restart VSCode for settings to take effect)
it_it: [Facoltativo] Opzioni di configurazione per la localizzazione di VSCode (è necessario riavviare VSCode per rendere le impostazioni effettive)

# mssql.query.displayBitAsNumber
source: Should BIT columns be displayed as numbers (1 or 0)? If false, BIT columns will be displayed as 'true' or 'false'
it_it: Le colonne di tipo BIT devono essere visualizzati come numeri (1 o 0)? Se 'false', verranno visualizzate come 'true' o 'false'

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
it_it: IntelliSense deve essere abilitato?

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
it_it: Il controllo degli errori di IntelliSense deve essere abilitato?

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
it_it: I suggerimenti IntelliSense devono essere abilitati?

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
it_it: Le informazioni rapide IntelliSense devono essere abilitate?

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
it_it: I suggerimenti di IntelliSense devono essere in lettere minuscole?
