Repository: tarikmanoar/vsCode-Extensions
Catalog: *-mssql.mssql-1.7.0/localization/xliff/deu/localizedPackage.json.deu.xlf
Languages: de_de

# extension.runQuery
source: Execute Query
de_de: Abfrage ausführen

# extension.runCurrentStatement
source: Execute Current Statement
de_de: Aktuelle Anweisung ausführen

# extension.cancelQuery
source: Cancel Query
de_de: Abfrage abbrechen

# extension.connect
source: Connect
de_de: Verbinden

# extension.disconnect
source: Disconnect
de_de: Trennen

# extension.manageProfiles
source: Manage Connection Profiles
de_de: Verbindungsprofile verwalten

# extension.chooseDatabase
source: Use Database
de_de: Datenbank verwenden

# extension.chooseLanguageFlavor
source: Choose SQL handler for this file
de_de: Wählen Sie den SQL-Handler für diese Datei

# extension.showGettingStarted
source: Getting Started Guide
de_de: Erste Schritte

# extension.newQuery
source: New Query
de_de: Neue Abfrage

# extension.rebuildIntelliSenseCache
source: Refresh IntelliSense Cache
de_de: IntelliSense Cache aktualisieren

# mssql.logDebugInfo
source: [Optional] Log debug output to the VS Code console (Help -> Toggle Developer Tools)
de_de: [Optional] Protokolliere die Debugausgaben mit der VS Code Konsole (Hilfe -> Entwicklertools umschalten)

# mssql.maxRecentConnections
source: The maximum number of recently used connections to store in the connection list.
de_de: Die maximale Anzahl an zuletzt verwendeten Verbindungen, die in der Verbindungsliste abgelegt werden.

# mssql.connections
source: Connection profiles defined in 'User Settings' are shown under 'MS SQL: Connect' command in the command palette.
de_de: Verbindungsprofile, die in "Benutzereinstellungen" definiert wurden, werden wärend des "MS SQL: Verbinden"-Kommandos in der Befehlspalette angezeigt.

# mssql.connection.server
source: [Required] Specify the server name to connect to. Use 'hostname\\instance' or '<server>.database.windows.net' for Azure SQL Database.
de_de: [Notwendig] Geben Sie den Server Namen ein. Verwenden Sie 'hostname\\instanz' oder <servername>.database.windows.net' für Azure SQL Database.

# mssql.connection.database
source: [Optional] Specify the database name to connect to. If database is not specified, the default user database setting is used, typically 'master'.
de_de: [Optional] Geben Sie den Namen der Datenbank an, mit der Sie verbunden werden wollen. Wenn keine Datenbank angegeben ist, dann wird die Standardeinstellung des Benutzers verwendet. In der Regel ist dies "master".

# mssql.connection.user
source: [Optional] Specify the user name for SQL Server authentication. If user name is not specified, when you connect, you will be asked again.
de_de: [Optional] Geben Sie den Benutzernamen für die SQL Server Authentifizierung an. Wenn kein Name angegeben wird, dann werden Sie beim Verbinden erneut danach gefragt.

# mssql.connection.password
source: [Optional] Specify the password for SQL Server authentication. If password is not specified or already saved, when you connect, you will be asked again.
de_de: [Optional] Geben Sie das Passwort für die SQL Server Authentifizierung an. Wenn keines angegeben wird oder bereits gespeichert wurde, dann werden Sie beim Verbinden erneut danach gefragt.

# mssql.connection.authenticationType
source: [Optional] Specify the SQL Server authentication type.
de_de: [Optional] Geben Sie den SQL Server-Authentifizierungstyp an.

# mssql.connection.port
source: [Optional] Specify the port number to connect to.
de_de: [Optional] Geben Sie den Port für die Verbindung ein.

# mssql.connection.encrypt
source: [Optional] When set to 'true', SQL Server uses SSL encryption for data sent between the client and the server if the server has a certificate installed. Set 'true' for Azure SQL Database connection.
de_de: [Optional] Wenn der Wert auf 'true' gesetzt wird, verwendet der SQL Server die SSL-Verschlüsselung für alle zwischen dem Client und Server gesendeten Daten, wenn auf dem Server ein Zertifikat installiert ist. "true" setzen für Azure SQL Datenbank Verbindungen.

# mssql.connection.trustServerCertificate
source: [Optional] When set to 'true', the SQL Server SSL certificate is automatically trusted when the communication layer is encrypted using SSL. Set 'false' for Azure SQL Database connection.
de_de: [Optional] Wenn "wahr", dann wird das SQL Server SSL-Zertifikat automatisch als vertrauenswürdig eingestuft. (wenn die Kommunikation mit SSL verschlüsselt ist). Für Azure SQL-Datenbanken auf "falsch" setzen.

# mssql.connection.persistSecurityInfo
source: [Optional] When set to false, security-sensitive information, such as the password, is not returned as part of the connection if the connection is open or has ever been in an open state.
de_de: [Optional] Wenn der Wert auf 'false' gesetzt wird, werden sicherheitsrelevante Informationen wie z. B. das Kennwort nicht als Teil der Verbindung zurückgegeben, wenn die Verbindung geöffnet ist oder bereits einmal in einem geöffneten Status war.

# mssql.connection.connectTimeout
source: [Optional] Specify the length of time in seconds to wait for a connection to the server before it times out. The default timeout value for Azure SQL Database is 30.
de_de: [Optional] Geben Sie das Zeitlimit in Sekunden an, wie lange auf eine Verbindung zum Server gewartet werden soll. Der Standard-Timeoutwert für Azure SQL-Datenbanken ist 30.

# mssql.connection.connectRetryCount
source: [Optional] Specify the number of attempts to restore connection.
de_de: [Optional] Geben Sie die Anzahl der Versuche an, um die Verbindung wiederherzustellen.

# mssql.connection.connectRetryInterval
source: [Optional] Specify the delay between attempts to restore connection.
de_de: [Optional] Geben Sie die Verzögerung zwischen den Versuchen an, um die Verbindung wiederherzustellen.

# mssql.connection.workstationId
source: [Optional] Specify the name of the workstation connecting to SQL Server.
de_de: [Optional] Geben Sie den Namen der mit dem SQL Server verbindenden Arbeitsstation an.

# mssql.connection.applicationName
source: [Optional] Specify the name of the application used for SQL Server to log (default: 'vscode-mssql').
de_de: [Optional] Geben Sie den Namen der Anwendung an, den SQL Server protokollieren soll (Standard: 'vscode-mssql').

# mssql.connection.applicationIntent
source: [Optional] Declares the application workload type when connecting to SQL Server such as ReadWrite or ReadOnly. Refer to SQL Server AlwaysOn for more detail.
de_de: [Optional] Gibt den Anwendungstyp bei der Verbindung mit SQL Server an, z. B. ReadWrite oder ReadOnly. Mehr Details finden Sie unter SQL Server AlwaysOn.

# mssql.connection.currentLanguage
source: [Optional] Indicates the SQL Server language settings.
de_de: [Optional] Zeigt die SQL Server-Spracheinstellungen.

# mssql.connection.pooling
source: [Optional] When set to 'true', the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool.
de_de: [Optional] Bei "Ja" wird das Verbindungs-Objekt ist aus dem entsprechenden Pool entnommen oder bei Bedarf erstellt und dem entsprechenden Pool hinzugefügt.

# mssql.connection.maxPoolSize
source: [Optional] Specify the maximum number of connections allowed in the pool.
de_de: [Optional] Geben Sie die maximale zulässige Anzahl von Verbindungen im Pool an.

# mssql.connection.minPoolSize
source: [Optional] Specify the minimum number of connections allowed in the pool.
de_de: [Optional] Geben Sie die zulässige minimale Anzahl von Verbindungen im Pool an.

# mssql.connection.loadBalanceTimeout
source: [Optional] Specify the minimum amount of time in seconds for this connection to live in the pool before being removed/deleted.
de_de: [Optional] Geben Sie die minimale Zeit in Sekunden an, die diese Verbindung im Pool bleiben soll, bevor sie entfernt/gelöscht wird.

# mssql.connection.replication
source: [Optional] Used by SQL Server in replication.
de_de: [Optional] Von SQL Server bei der Replikation verwendet.

# mssql.connection.attachDbFilename
source: [Optional] Specify the name of the primary file, including the full path name, of an attachable database.
de_de: [Optional] Geben Sie den Namen der primären Datei, einschließlich des vollständigen Pfadnamens, für die anzufügende Datenbank ein.

# mssql.connection.failoverPartner
source: [Optional] Specify the name or network address of the instance of SQL Server that acts as a failover partner.
de_de: [Optional] Geben Sie den Namen oder die Netzwerk-Adresse der Instanz von SQL Server an, die als Failover-Partner fungiert.

# mssql.connection.multiSubnetFailover
source: [Optional] When set to 'true', the detection and connection to the active server is faster if AlwaysOn Availability Group is configured on different subnets.
de_de: [Optional] Bei "Ja" ist die Erkennung von und Verbindung mit dem aktiven Server schneller, wenn AlwaysOn Availability Group in unterschiedlichen Subnetzen konfiguriert ist.

# mssql.connection.multipleActiveResultSets
source: [Optional] When set to 'true', multiple result sets can be returned and read from on connection.
de_de: [Optional] Bei "Ja" können mehrere Ergebnismengen über eine Verbindung zurückgegeben und gelesen werden.

# mssql.connection.packetSize
source: [Optional] Specify the size in bytes of the network packets to communicate with SQL Server.
de_de: [Optional] Geben Sie die Größe der Netzwerkpakete in Bytes an, die für die Kommunikation mit dem SQL Server verwendet werden soll.

# mssql.connection.typeSystemVersion
source: [Optional] Indicates which server type the provider will expose through the DataReader.
de_de: [Optional] Gibt an, welchen Servertyp der Anbieter durch den DataReader angeben wird.

# mssql.connection.connectionString
source: [Optional] The ADO.NET connection string to use for the connection. Overrides any other options given in this connection.
de_de: [Optional] Die ADO.NET Verbindungszeichenfolge, die für die Verbindung verwendet werden soll. Übersteuert alle anderen Optionen dieser Verbindung.

# mssql.connection.profileName
source: [Optional] Specify a custom name for this connection profile to easily browse and search in the command palette of Visual Studio Code.
de_de: [Optional] Geben Sie einen benutzerdefinierten Namen für dieses Verbindungsprofil an, um die Suche innerhalb der Befehlspalette von Visual Studio Code zu erleichtern.

# mssql.connection.savePassword
source: [Optional] When set to 'true', the password for SQL Server authentication is saved in the secure store of your operating system such as KeyChain in MacOS or Secure Store in Windows.
de_de: [Optional] Bei "Ja" wird das Kennwort für die SQL Server-Authentifizierung im sicheren Speicher Ihres Betriebssystems gespeichert, wie z.B. Schlüsselbund in MacOS oder Secure Store in Windows.

# mssql.connection.emptyPasswordInput
source: [Optional] Indicates whether this profile has an empty password explicitly set
de_de: [Optional] Gibt an, ob für dieses Profil explizit ein leeres Passwort festgelegt ist

# mssql.shortcuts
source: Shortcuts related to the results window
de_de: Kurzbefehle, die sich auf das Ergebnisfenster beziehen.

# mssql.messagesDefaultOpen
source: True for the messages pane to be open by default; false for closed
de_de: "True" damit das Nachrichtenfenster standardmässig geöffnet wird; "False" für geschlossen

# mssql.resultsFontFamily
source: Set the font family for the results grid; set to blank to use the editor font
de_de: Legen Sie die Schriftfamilie für den Ergebnisbereich fest; leer lassen, um die Editor-Schriftart zu verwenden

# mssql.resultsFontSize
source: Set the font size for the results grid; set to blank to use the editor size
de_de: Legen Sie die Schriftgröße für den Ergebnisbereich fest; leer lassen, um die Editor-Schriftgröße zu verwenden

# mssql.saveAsCsv.includeHeaders
source: [Optional] When true, column headers are included when saving results as CSV
de_de: [Optional] Bei "Ja" werden die Spaltenüberschriften beim Speichern der Ergebnisse als CSV mit ausgegeben

# mssql.copyIncludeHeaders
source: [Optional] Configuration options for copying results from the Results View
de_de: [Optional] Konfigurations-Optionen für das Kopieren von Ergebnissen aus der Ergebnisansicht

# mssql.copyRemoveNewLine
source: [Optional] Configuration options for copying multi-line results from the Results View
de_de: [Optional] Konfigurations-Optionen für das Kopieren von mehrzeiligen Ergebnisse aus der Ergebnisansicht

# mssql.showBatchTime
source: [Optional] Should execution time be shown for individual batches
de_de: [Optional] Soll die Ausführungszeit für einzelne Aufrufe angezeigt werden

# mssql.splitPaneSelection
source: [Optional] Configuration options for which column new result panes should open in
de_de: [Optional] Konfigurations-Optionen, in welcher Spalte neue Ergebnisansichten geöffnet werden

# mssql.format.alignColumnDefinitionsInColumns
source: Should column definitions be aligned?
de_de: Sollen Spaltendefinitionen ausgerichtet werden?

# mssql.format.datatypeCasing
source: Should data types be formatted as UPPERCASE, lowercase, or none (not formatted)
de_de: Sollen Datentypen in Großbuchstaben, Kleinbuchstaben oder gar nicht formatiert werden

# mssql.format.keywordCasing
source: Should keywords be formatted as UPPERCASE, lowercase, or none (not formatted)
de_de: Sollen Schlüsselwörter in Großbuchstaben, Kleinbuchstaben oder gar nicht formatiert werden

# mssql.format.placeCommasBeforeNextStatement
source: should commas be placed at the beginning of each statement in a list e.g. ', mycolumn2' instead of at the end e.g. 'mycolumn1,'
de_de: Sollen Kommas am Anfang jeder Anweisung in einer Liste platziert werden, z. B. ', mycolumn2' amstatt am Ende, z. B. 'mycolumn1,'

# mssql.format.placeSelectStatementReferencesOnNewLine
source: Should references to objects in a select statements be split into separate lines? E.g. for 'SELECT C1, C2 FROM T1' both C1 and C2 will be on separate lines
de_de: Sollten Verweise auf Objekte in einer SELECT-Anweisung in separaten Zeilen angezeigt werden? Z. B. werden bei "SELECT C1, C2 FROM T1" C1 und C2 jeweils in separaten Zeilen angezeigt

# mssql.applyLocalization
source: [Optional] Configuration options for localizing into VSCode's configured locale (must restart VSCode for settings to take effect)
de_de: [Optional] Konfigurationsoptionen für die Lokalisierung in das von VS Code konfigurierte Gebietsschema (VS Code muss neu gestartet werden, damit diese Einstellungen wirksam werden)

# mssql.query.displayBitAsNumber
source: Should BIT columns be displayed as numbers (1 or 0)? If false, BIT columns will be displayed as 'true' or 'false'
de_de: BIT-Spalten als Zahlen (1 oder 0) anzeigen? Wenn nicht, werden BIT-Spalten als "wahr" oder "falsch" angezeigt

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
de_de: Soll IntelliSense aktiviert werden

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
de_de: Soll IntelliSense Fehlerüberprüfung aktiviert werden

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
de_de: Sollen IntelliSense Vorschläge aktiviert werden

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
de_de: Soll IntelliSense Schnell-Info aktiviert werden

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
de_de: Sollen IntelliSense-Vorschläge in Kleinbuchstaben sein
