Repository: tarikmanoar/vsCode-Extensions
Catalog: *-mssql.mssql-1.7.0/localization/xliff/ptb/localizedPackage.json.ptb.xlf
Languages: pt_br

# extension.runQuery
source: Execute Query
pt_br: Executar consulta

# extension.runCurrentStatement
source: Execute Current Statement
pt_br: Execute a instrução atual

# extension.cancelQuery
source: Cancel Query
pt_br: Cancelar a consulta

# extension.connect
source: Connect
pt_br: Conectar

# extension.disconnect
source: Disconnect
pt_br: Desconectar

# extension.manageProfiles
source: Manage Connection Profiles
pt_br: Gerenciar perfis de Conexão

# extension.chooseDatabase
source: Use Database
pt_br: Use o Banco de Dados

# extension.chooseLanguageFlavor
source: Choose SQL handler for this file
pt_br: Escolha o manipulador SQL para este arquivo

# extension.showGettingStarted
source: Getting Started Guide
pt_br: Guia de Primeiros Passos

# extension.newQuery
source: New Query
pt_br: Nova Consulta

# extension.rebuildIntelliSenseCache
source: Refresh IntelliSense Cache
pt_br: Atualizar o Cache do IntelliSense

# mssql.logDebugInfo
source: [Optional] Log debug output to the VS Code console (Help -> Toggle Developer Tools)
pt_br: [Opcional] Saída de depuração de log para o console do VS Code (Ajuda -> Alternar Ferramentas de Desenvolvimento)

# mssql.maxRecentConnections
source: The maximum number of recently used connections to store in the connection list.
pt_br: O número máximo de conexões usadas recentemente para armazenar na lista de conexões.

# mssql.connections
source: Connection profiles defined in 'User Settings' are shown under 'MS SQL: Connect' command in the command palette.
pt_br: Perfis de Conexão definidas em 'Configurações de usuário' são mostrados sob o comando 'MS SQL: Conectar' na paleta de comando.

# mssql.connection.server
source: [Required] Specify the server name to connect to. Use 'hostname\\instance' or '<server>.database.windows.net' for Azure SQL Database.
pt_br: [Necessário] Especifique o nome do servidor para se conectar. Use 'hostname\\instance' ou ' <server>. database.windows.net' para um banco de dados SQL Azure.

# mssql.connection.database
source: [Optional] Specify the database name to connect to. If database is not specified, the default user database setting is used, typically 'master'.
pt_br: [Opcional] Especifique o nome do banco de dados para se conectar. Se o banco de dados não for especificado, a configuração do banco de dados de usuário padrão é usado, normalmente o banco de dados 'master'.

# mssql.connection.user
source: [Optional] Specify the user name for SQL Server authentication. If user name is not specified, when you connect, you will be asked again.
pt_br: [Opcional] Especifique o nome de usuário para autenticação do SQL Server. Se o nome de usuário não for especificado, quando você se conectar será solicitado novamente.

# mssql.connection.password
source: [Optional] Specify the password for SQL Server authentication. If password is not specified or already saved, when you connect, you will be asked again.
pt_br: [Opcional] Especifica a senha para autenticação do SQL Server. Se a senha não é especificada ou já está salva, quando você se conectar, você será solicitado novamente.

# mssql.connection.authenticationType
source: [Optional] Specify the SQL Server authentication type.
pt_br: [Opcional] Especifique o tipo de autenticação do SQL Server.

# mssql.connection.port
source: [Optional] Specify the port number to connect to.
pt_br: [Opcional] Especifica o número da porta para se conectar.

# mssql.connection.encrypt
source: [Optional] When set to 'true', SQL Server uses SSL encryption for data sent between the client and the server if the server has a certificate installed. Set 'true' for Azure SQL Database connection.
pt_br: [Opcional] Quando definido como 'verdadeiro', o SQL Server usa a criptografia SSL para dados enviados entre o cliente e o servidor se o servidor tem um certificado instalado. Defina 'verdadeiro', para conexão de banco de dados SQL Azure.

# mssql.connection.trustServerCertificate
source: [Optional] When set to 'true', the SQL Server SSL certificate is automatically trusted when the communication layer is encrypted using SSL. Set 'false' for Azure SQL Database connection.
pt_br: [Opcional] Quando definido como 'verdadeiro', o certificado SSL do servidor SQL é automaticamente confiável quando a camada de comunicação é criptografada com SSL. Defina 'falso' para conexão de banco de dados SQL Azure.

# mssql.connection.persistSecurityInfo
source: [Optional] When set to false, security-sensitive information, such as the password, is not returned as part of the connection if the connection is open or has ever been in an open state.
pt_br: [Opcional] Quando definido como falso, informações sensíveis à segurança, como a senha, não é retornado como parte da conexão se a conexão estiver aberta ou nunca esteve em um estado aberto.

# mssql.connection.connectTimeout
source: [Optional] Specify the length of time in seconds to wait for a connection to the server before it times out. The default timeout value for Azure SQL Database is 30.
pt_br: [Opcional] Especifica o tempo em segundos para aguardar uma conexão para o servidor antes que exceda o tempo limite. O valor de tempo limite padrão para o banco de dados SQL Azure é 30.

# mssql.connection.connectRetryCount
source: [Optional] Specify the number of attempts to restore connection.
pt_br: [Opcional] Especifica o número de tentativas para restaurar a conexão.

# mssql.connection.connectRetryInterval
source: [Optional] Specify the delay between attempts to restore connection.
pt_br: [Opcional] Especifique o intervalo entre as tentativas de restabelecer a conexão.

# mssql.connection.workstationId
source: [Optional] Specify the name of the workstation connecting to SQL Server.
pt_br: [Opcional] Especifique o nome da estação da conexão ao SQL Server.

# mssql.connection.applicationName
source: [Optional] Specify the name of the application used for SQL Server to log (default: 'vscode-mssql').
pt_br: [Opcional] Especifique o nome do aplicativo usado para o SQL Server para log (padrão: 'vscode-mssql').

# mssql.connection.applicationIntent
source: [Optional] Declares the application workload type when connecting to SQL Server such as ReadWrite or ReadOnly. Refer to SQL Server AlwaysOn for more detail.
pt_br: [Opcional] Declara o tipo de carga de trabalho do aplicativo ao se conectar ao SQL Server como Leitura e Escrita ou somente Leitura. Consulte o SQL Server AlwaysOn para mais detalhes.

# mssql.connection.currentLanguage
source: [Optional] Indicates the SQL Server language settings.
pt_br: [Opcional] Indica as configurações de idioma do SQL Server.

# mssql.connection.pooling
source: [Optional] When set to 'true', the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool.
pt_br: [Opcional] Quando definido como 'verdadeiro', o objeto de conexão é desenhado a partir do pool adequado, ou se necessário, é criado e adicionado ao pool adequado.

# mssql.connection.maxPoolSize
source: [Optional] Specify the maximum number of connections allowed in the pool.
pt_br: [Opcional] Especifica o número máximo de conexões permitidas no pool.

# mssql.connection.minPoolSize
source: [Optional] Specify the minimum number of connections allowed in the pool.
pt_br: [Opcional] Especifica o número mínimo de conexões permitidas no pool.

# mssql.connection.loadBalanceTimeout
source: [Optional] Specify the minimum amount of time in seconds for this connection to live in the pool before being removed/deleted.
pt_br: [Opcional] Especifica a quantidade mínima de tempo em segundos para o tempo de vida desta conexão no pool antes de ser removida ou excluída.

# mssql.connection.replication
source: [Optional] Used by SQL Server in replication.
pt_br: [Opcional] Usado pelo SQL Server na replicação.

# mssql.connection.attachDbFilename
source: [Optional] Specify the name of the primary file, including the full path name, of an attachable database.
pt_br: [Opcional] Especifique o nome do arquivo primário, incluindo o nome de caminho completo, de um banco de dados anexável.

# mssql.connection.failoverPartner
source: [Optional] Specify the name or network address of the instance of SQL Server that acts as a failover partner.
pt_br: [Opcional] Especifica o endereço de rede ou o nome da instância do SQL Server que atua como um parceiro de failover.

# mssql.connection.multiSubnetFailover
source: [Optional] When set to 'true', the detection and connection to the active server is faster if AlwaysOn Availability Group is configured on different subnets.
pt_br: [Opcional] Quando definido como 'verdadeiro', a detecção e a conexão ao servidor ativo é mais rápido se o grupo de disponibilidade do AlwaysOn é configurado em sub-redes diferentes.

# mssql.connection.multipleActiveResultSets
source: [Optional] When set to 'true', multiple result sets can be returned and read from on connection.
pt_br: [Opcional] Quando definido como 'verdadeiro', múltiplos conjuntos de resultados podem ser retornados e lidos na conexão.

# mssql.connection.packetSize
source: [Optional] Specify the size in bytes of the network packets to communicate with SQL Server.
pt_br: [Opcional] Especifica o tamanho em bytes dos pacotes de rede para se comunicar com o SQL Server.

# mssql.connection.typeSystemVersion
source: [Optional] Indicates which server type the provider will expose through the DataReader.
pt_br: [Opcional] Indica qual tipo de servidor o provedor irá expor através do DataReader.

# mssql.connection.connectionString
source: [Optional] The ADO.NET connection string to use for the connection. Overrides any other options given in this connection.
pt_br: [Opcional] A sequência de conexão ADO.NET a ser usada para a conexão. Substitui quaisquer outras opções desta conexão.

# mssql.connection.profileName
source: [Optional] Specify a custom name for this connection profile to easily browse and search in the command palette of Visual Studio Code.
pt_br: [Opcional] Especifica um nome personalizado para este perfil de conexão para facilmente navegar e pesquisar na paleta de comando do Visual Studio Code.

# mssql.connection.savePassword
source: [Optional] When set to 'true', the password for SQL Server authentication is saved in the secure store of your operating system such as KeyChain in MacOS or Secure Store in Windows.
pt_br: [Opcional] Quando definido como 'verdadeiro', a senha para a autenticação SQL Server é salva no armazenamento seguro de seu sistema operacional como o KeyChain no MacOS ou Secure Store no Windows.

# mssql.connection.emptyPasswordInput
source: [Optional] Indicates whether this profile has an empty password explicitly set
pt_br: [Opcional] Indica se este perfil tem uma senha vazia definida explicitamente

# mssql.shortcuts
source: Shortcuts related to the results window
pt_br: Atalhos relacionados à janela de resultados

# mssql.messagesDefaultOpen
source: True for the messages pane to be open by default; false for closed
pt_br: Verdadeiro para o painel de mensagens ser aberto por padrão; falso para fechado

# mssql.resultsFontFamily
source: Set the font family for the results grid; set to blank to use the editor font
pt_br: Definir a família de fontes para a grade de resultados; definido como em branco para usar a fonte do editor

# mssql.resultsFontSize
source: Set the font size for the results grid; set to blank to use the editor size
pt_br: Definir o tamanho da fonte para a grade de resultados; definido como em branco para usar o tamanho do editor

# mssql.saveAsCsv.includeHeaders
source: [Optional] When true, column headers are included when saving results as CSV
pt_br: [Opcional] Quando verdadeiro, os cabeçalhos de coluna são incluídos ao salvar os resultados como CSV

# mssql.copyIncludeHeaders
source: [Optional] Configuration options for copying results from the Results View
pt_br: [Opcional] Opções de configuração para copiar os resultados da exibição de resultados

# mssql.copyRemoveNewLine
source: [Optional] Configuration options for copying multi-line results from the Results View
pt_br: [Opcional] Opções de configuração para copiar os resultados de várias linhas do modo de exibição de resultados

# mssql.showBatchTime
source: [Optional] Should execution time be shown for individual batches
pt_br: [Opcional] Tempo de execução deve ser mostrado para lotes individuais

# mssql.splitPaneSelection
source: [Optional] Configuration options for which column new result panes should open in
pt_br: [Opcional] Opções de configuração para qual os painéis de resultados de novas colunas devem ser abertos

# mssql.format.alignColumnDefinitionsInColumns
source: Should column definitions be aligned?
pt_br: Definições de coluna devem ser alinhadas?

# mssql.format.datatypeCasing
source: Should data types be formatted as UPPERCASE, lowercase, or none (not formatted)
pt_br: Tipos de dados formatados como letras MAIÚSCULAS, minúsculas, ou nenhum (não formatado)?

# mssql.format.keywordCasing
source: Should keywords be formatted as UPPERCASE, lowercase, or none (not formatted)
pt_br: Palavras-chave devem ser formatados letras MAIÚSCULAS, minúsculas, ou nenhum (não formatado)?

# mssql.format.placeCommasBeforeNextStatement
source: should commas be placed at the beginning of each statement in a list e.g. ', mycolumn2' instead of at the end e.g. 'mycolumn1,'
pt_br: vírgulas devem ser colocadas no início de cada instrução em uma lista? Por exemplo, ', minhacoluna2' em vez de no final, por exemplo, 'minhacoluna1,'

# mssql.format.placeSelectStatementReferencesOnNewLine
source: Should references to objects in a select statements be split into separate lines? E.g. for 'SELECT C1, C2 FROM T1' both C1 and C2 will be on separate lines
pt_br: Referências a objetos em uma instrução select devem ser divididas em linhas separadas? Por exemplo, para 'SELECT C1, C2 FROM T1' onde C1 e C2 deverão estar em linhas separadas

# mssql.applyLocalization
source: [Optional] Configuration options for localizing into VSCode's configured locale (must restart VSCode for settings to take effect)
pt_br: [Opcional] Opções de configuração para localização no local configurado do VSCode (deve reiniciar o VSCode para que as configurações entrem em vigor)

# mssql.query.displayBitAsNumber
source: Should BIT columns be displayed as numbers (1 or 0)? If false, BIT columns will be displayed as 'true' or 'false'
pt_br: Colunas do tipo BIT devem ser exibidas como números (1 ou 0)? Se falso, colunas do tipo BIT serão exibidas como 'verdadeiro' ou 'falso'

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
pt_br: IntelliSense deve ser habilitado?

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
pt_br: Verificação de erros de IntelliSense devem ser habilitados?

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
pt_br: Sugestões de IntelliSense devem ser habilitados?

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
pt_br: Informações rápidas de IntelliSense devem ser habilitadas?

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
pt_br: Sugestões de IntelliSense devem ser em letras minúsculas?
