{
"mssql.runQuery":"Execute Query",
"mssql.runCurrentStatement":"Execute Current Statement",
"mssql.cancelQuery":"Cancel Query",
"mssql.addObjectExplorer":"Add Connection",
"mssql.scriptSelect":"Select Top 1000",
"mssql.scriptCreate":"Script as Create",
"mssql.scriptDelete":"Script as Drop",
"mssql.scriptExecute":"Script as Execute",
"mssql.scriptAlter":"Script as Alter",
"mssql.removeObjectExplorerNode":"Remove",
"mssql.refreshObjectExplorerNode":"Refresh",
"extension.connections":"Connections",
"mssql.connect":"Connect",
"mssql.disconnect":"Disconnect",
"mssql.manageProfiles":"Manage Connection Profiles",
"mssql.chooseDatabase":"Use Database",
"mssql.chooseLanguageFlavor":"Choose SQL handler for this file",
"mssql.showGettingStarted":"Getting Started Guide",
"mssql.newQuery":"New Query",
"mssql.objectExplorerNewQuery":"New Query",
"mssql.toggleSqlCmd":"Toggle SQLCMD Mode",
"mssql.rebuildIntelliSenseCache":"Refresh IntelliSense Cache",
"mssql.logDebugInfo":"[Optional] Protokolliere die Debugausgaben mit der VS Code Konsole (Hilfe -> Entwicklertools umschalten)",
"mssql.maxRecentConnections":"Die maximale Anzahl an zuletzt verwendeten Verbindungen, die in der Verbindungsliste abgelegt werden.",
"mssql.connections":"Verbindungsprofile, die in 'Benutzereinstellungen' definiert wurden, werden wärend des 'MS SQL: Verbinden'-Kommandos in der Befehlspalette angezeigt.",
"mssql.connection.server":"[Notwendig] Geben Sie den Server Namen ein. Verwenden Sie 'hostname\\instanz' oder <servername>.database.windows.net' für Azure SQL Database.",
"mssql.connection.database":"[Optional] Geben Sie den Namen der Datenbank an, mit der Sie verbunden werden wollen. Wenn keine Datenbank angegeben ist, dann wird die Standardeinstellung des Benutzers verwendet. In der Regel ist dies 'master'.",
"mssql.connection.user":"[Optional] Geben Sie den Benutzernamen für die SQL Server Authentifizierung an. Wenn kein Name angegeben wird, dann werden Sie beim Verbinden erneut danach gefragt.",
"mssql.connection.password":"[Optional] Geben Sie das Passwort für die SQL Server Authentifizierung an. Wenn keines angegeben wird oder bereits gespeichert wurde, dann werden Sie beim Verbinden erneut danach gefragt. ",
"mssql.connection.authenticationType":"[Optional] Geben Sie den SQL Server-Authentifizierungstyp an.",
"mssql.connection.port":"[Optional] Geben Sie den Port für die Verbindung ein.",
"mssql.connection.encrypt":"[Optional] Wenn der Wert auf 'true' gesetzt wird, verwendet der SQL Server die SSL-Verschlüsselung für alle zwischen dem Client und Server gesendeten Daten, wenn auf dem Server ein Zertifikat installiert ist. 'true' setzen für Azure SQL Datenbank Verbindungen.",
"mssql.connection.trustServerCertificate":"[Optional] Wenn 'wahr', dann wird das SQL Server SSL-Zertifikat automatisch als vertrauenswürdig eingestuft. (wenn die Kommunikation mit SSL verschlüsselt ist). Für Azure SQL-Datenbanken auf 'falsch' setzen. ",
"mssql.connection.persistSecurityInfo":"[Optional] Wenn der Wert auf 'false' gesetzt wird, werden sicherheitsrelevante Informationen wie z. B. das Kennwort nicht als Teil der Verbindung zurückgegeben, wenn die Verbindung geöffnet ist oder bereits einmal in einem geöffneten Status war.",
"mssql.connection.connectTimeout":"[Optional] Geben Sie das Zeitlimit in Sekunden an, wie lange auf eine Verbindung zum Server gewartet werden soll. Der Standard-Timeoutwert für Azure SQL-Datenbanken ist 30.",
"mssql.connection.connectRetryCount":"[Optional] Geben Sie die Anzahl der Versuche an, um die Verbindung wiederherzustellen.",
"mssql.connection.connectRetryInterval":"[Optional] Geben Sie die Verzögerung zwischen den Versuchen an, um die Verbindung wiederherzustellen.",
"mssql.connection.workstationId":"[Optional] Geben Sie den Namen der mit dem SQL Server verbindenden Arbeitsstation an.",
"mssql.connection.applicationName":"[Optional] Geben Sie den Namen der Anwendung an, den SQL Server protokollieren soll (Standard: 'vscode-mssql').",
"mssql.connection.applicationIntent":"[Optional] Gibt den Anwendungstyp bei der Verbindung mit SQL Server an, z. B. ReadWrite oder ReadOnly. Mehr Details finden Sie unter SQL Server AlwaysOn.",
"mssql.connection.currentLanguage":"[Optional] Zeigt die SQL Server-Spracheinstellungen.",
"mssql.connection.pooling":"[Optional] Bei 'Ja' wird das Verbindungs-Objekt ist aus dem entsprechenden Pool entnommen oder bei Bedarf erstellt und dem entsprechenden Pool hinzugefügt.",
"mssql.connection.maxPoolSize":"[Optional] Geben Sie die maximale zulässige Anzahl von Verbindungen im Pool an.",
"mssql.connection.minPoolSize":"[Optional] Geben Sie die zulässige minimale Anzahl von Verbindungen im Pool an.",
"mssql.connection.loadBalanceTimeout":"[Optional] Geben Sie die minimale Zeit in Sekunden an, die diese Verbindung im Pool bleiben soll, bevor sie entfernt/gelöscht wird.",
"mssql.connection.replication":"[Optional] Von SQL Server bei der Replikation verwendet.",
"mssql.connection.attachDbFilename":"[Optional] Geben Sie den Namen der primären Datei, einschließlich des vollständigen Pfadnamens, für die anzufügende Datenbank ein.",
"mssql.connection.failoverPartner":"[Optional] Geben Sie den Namen oder die Netzwerk-Adresse der Instanz von SQL Server an, die als Failover-Partner fungiert.",
"mssql.connection.multiSubnetFailover":"[Optional] Bei 'Ja' ist die Erkennung von und Verbindung mit dem aktiven Server schneller, wenn AlwaysOn Availability Group in unterschiedlichen Subnetzen konfiguriert ist.",
"mssql.connection.multipleActiveResultSets":"[Optional] Bei 'Ja' können mehrere Ergebnismengen über eine Verbindung zurückgegeben und gelesen werden.",
"mssql.connection.packetSize":"[Optional] Geben Sie die Größe der Netzwerkpakete in Bytes an, die für die Kommunikation mit dem SQL Server verwendet werden soll.",
"mssql.connection.typeSystemVersion":"[Optional] Gibt an, welchen Servertyp der Anbieter durch den DataReader angeben wird.",
"mssql.connection.connectionString":"[Optional] Die ADO.NET Verbindungszeichenfolge, die für die Verbindung verwendet werden soll. Übersteuert alle anderen Optionen dieser Verbindung.",
"mssql.connection.profileName":"[Optional] Geben Sie einen benutzerdefinierten Namen für dieses Verbindungsprofil an, um die Suche innerhalb der Befehlspalette von Visual Studio Code zu erleichtern.",
"mssql.connection.savePassword":"[Optional] Bei 'Ja' wird das Kennwort für die SQL Server-Authentifizierung im sicheren Speicher Ihres Betriebssystems gespeichert, wie z.B. Schlüsselbund in MacOS oder Secure Store in Windows.",
"mssql.connection.emptyPasswordInput":"[Optional] Gibt an, ob für dieses Profil explizit ein leeres Passwort  festgelegt ist",
"mssql.shortcuts":"Kurzbefehle, die sich auf das Ergebnisfenster beziehen.",
"mssql.messagesDefaultOpen":"'True' damit das Nachrichtenfenster standardmässig geöffnet wird; 'False' für geschlossen",
"mssql.resultsFontFamily":"Legen Sie die Schriftfamilie für den Ergebnisbereich fest; leer lassen, um die Editor-Schriftart zu verwenden",
"mssql.resultsFontSize":"Legen Sie die Schriftgröße für den Ergebnisbereich fest; leer lassen, um die Editor-Schriftgröße zu verwenden",
"mssql.saveAsCsv.includeHeaders":"[Optional] Bei 'Ja' werden die Spaltenüberschriften beim Speichern der Ergebnisse als CSV mit ausgegeben",
"mssql.saveAsCsv.delimiter":"[Optional] Delimiter for separating data items when saving results as CSV",
"mssql.saveAsCsv.lineSeparator":"[Optional] Character(s) used for separating rows when saving results as CSV",
"mssql.saveAsCsv.textIdentifier":"[Optional] Character used for enclosing text fields when saving results as CSV",
"mssql.saveAsCsv.encoding":"[Optional] File encoding used when saving results as CSV",
"mssql.copyIncludeHeaders":"[Optional] Konfigurations-Optionen für das Kopieren von Ergebnissen aus der Ergebnisansicht",
"mssql.copyRemoveNewLine":"[Optional] Konfigurations-Optionen für das Kopieren von mehrzeiligen Ergebnisse aus der Ergebnisansicht",
"mssql.showBatchTime":"[Optional] Soll die Ausführungszeit für einzelne Aufrufe angezeigt werden",
"mssql.splitPaneSelection":"[Optional] Konfigurations-Optionen, in welcher Spalte neue Ergebnisansichten geöffnet werden",
"mssql.format.alignColumnDefinitionsInColumns":"Sollen Spaltendefinitionen ausgerichtet werden?",
"mssql.format.datatypeCasing":"Sollen Datentypen in Großbuchstaben, Kleinbuchstaben oder gar nicht formatiert werden",
"mssql.format.keywordCasing":"Sollen Schlüsselwörter in Großbuchstaben, Kleinbuchstaben oder gar nicht formatiert werden",
"mssql.format.placeCommasBeforeNextStatement":"Sollen Kommas am Anfang jeder Anweisung in einer Liste platziert werden, z. B. ', mycolumn2' amstatt am Ende, z. B. 'mycolumn1,'",
"mssql.format.placeSelectStatementReferencesOnNewLine":"Sollten Verweise auf Objekte in einer SELECT-Anweisung in separaten Zeilen angezeigt werden? Z. B. werden bei 'SELECT C1, C2 FROM T1' C1 und C2 jeweils in separaten Zeilen angezeigt",
"mssql.applyLocalization":"[Optional] Konfigurationsoptionen für die Lokalisierung in das von VS Code konfigurierte Gebietsschema (VS Code muss neu gestartet werden, damit diese Einstellungen wirksam werden)",
"mssql.query.displayBitAsNumber":"BIT-Spalten als Zahlen (1 oder 0) anzeigen? Wenn nicht, werden BIT-Spalten als 'wahr' oder 'falsch' angezeigt",
"mssql.intelliSense.enableIntelliSense":"Soll IntelliSense aktiviert werden",
"mssql.intelliSense.enableErrorChecking":"Soll IntelliSense Fehlerüberprüfung aktiviert werden",
"mssql.intelliSense.enableSuggestions":"Sollen IntelliSense Vorschläge aktiviert werden",
"mssql.intelliSense.enableQuickInfo":"Soll IntelliSense Schnell-Info aktiviert werden",
"mssql.intelliSense.lowerCaseSuggestions":"Sollen IntelliSense-Vorschläge in Kleinbuchstaben sein",
"mssql.persistQueryResultTabs":"Should query result selections and scroll positions be saved when switching tabs (may impact performance)"
}
