{
"mssql.runQuery":"Execute Query",
"mssql.runCurrentStatement":"Execute Current Statement",
"mssql.cancelQuery":"Cancel Query",
"mssql.addObjectExplorer":"Add Connection",
"mssql.scriptSelect":"Select Top 1000",
"mssql.scriptCreate":"Script as Create",
"mssql.scriptDelete":"Script as Drop",
"mssql.scriptExecute":"Script as Execute",
"mssql.scriptAlter":"Script as Alter",
"mssql.removeObjectExplorerNode":"Remove",
"mssql.refreshObjectExplorerNode":"Refresh",
"extension.connections":"Connections",
"mssql.connect":"Connect",
"mssql.disconnect":"Disconnect",
"mssql.manageProfiles":"Manage Connection Profiles",
"mssql.chooseDatabase":"Use Database",
"mssql.chooseLanguageFlavor":"Choose SQL handler for this file",
"mssql.showGettingStarted":"Getting Started Guide",
"mssql.newQuery":"New Query",
"mssql.objectExplorerNewQuery":"New Query",
"mssql.toggleSqlCmd":"Toggle SQLCMD Mode",
"mssql.rebuildIntelliSenseCache":"Refresh IntelliSense Cache",
"mssql.logDebugInfo":"[Opcional] Saída de depuração de log para o console do VS Code (Ajuda -> Alternar Ferramentas de Desenvolvimento)",
"mssql.maxRecentConnections":"O número máximo de conexões usadas recentemente para armazenar na lista de conexões.",
"mssql.connections":"Perfis de Conexão definidas em 'Configurações de usuário' são mostrados sob o comando 'MS SQL: Conectar' na paleta de comando.",
"mssql.connection.server":"[Necessário] Especifique o nome do servidor para se conectar. Use 'hostname\\instance' ou ' <server>. database.windows.net' para um banco de dados SQL Azure.",
"mssql.connection.database":"[Opcional] Especifique o nome do banco de dados para se conectar. Se o banco de dados não for especificado, a configuração do banco de dados de usuário padrão é usado, normalmente o banco de dados 'master'.",
"mssql.connection.user":"[Opcional] Especifique o nome de usuário para autenticação do SQL Server. Se o nome de usuário não for especificado, quando você se conectar será solicitado novamente.",
"mssql.connection.password":"[Opcional] Especifica a senha para autenticação do SQL Server. Se a senha não é especificada ou já está salva, quando você se conectar, você será solicitado novamente.",
"mssql.connection.authenticationType":"[Opcional] Especifique o tipo de autenticação do SQL Server.",
"mssql.connection.port":"[Opcional] Especifica o número da porta para se conectar.",
"mssql.connection.encrypt":"[Opcional] Quando definido como 'verdadeiro', o SQL Server usa a criptografia SSL para dados enviados entre o cliente e o servidor se o servidor tem um certificado instalado. Defina 'verdadeiro', para conexão de banco de dados SQL Azure.",
"mssql.connection.trustServerCertificate":"[Opcional] Quando definido como 'verdadeiro', o certificado SSL do servidor SQL é automaticamente confiável quando a camada de comunicação é criptografada com SSL. Defina 'falso' para conexão de banco de dados SQL Azure.",
"mssql.connection.persistSecurityInfo":"[Opcional] Quando definido como falso, informações sensíveis à segurança, como a senha, não é retornado como parte da conexão se a conexão estiver aberta ou nunca esteve em um estado aberto.",
"mssql.connection.connectTimeout":"[Opcional] Especifica o tempo em segundos para aguardar uma conexão para o servidor antes que exceda o tempo limite. O valor de tempo limite padrão para o banco de dados SQL Azure é 30.",
"mssql.connection.connectRetryCount":"[Opcional] Especifica o número de tentativas para restaurar a conexão.",
"mssql.connection.connectRetryInterval":"[Opcional] Especifique o intervalo entre as tentativas de restabelecer a conexão.",
"mssql.connection.workstationId":"[Opcional] Especifique o nome da estação da conexão ao SQL Server.",
"mssql.connection.applicationName":"[Opcional] Especifique o nome do aplicativo usado para o SQL Server para log (padrão: 'vscode-mssql').",
"mssql.connection.applicationIntent":"[Opcional] Declara o tipo de carga de trabalho do aplicativo ao se conectar ao SQL Server como Leitura e Escrita ou somente Leitura. Consulte o SQL Server AlwaysOn para mais detalhes.",
"mssql.connection.currentLanguage":"[Opcional] Indica as configurações de idioma do SQL Server.",
"mssql.connection.pooling":"[Opcional] Quando definido como 'verdadeiro', o objeto de conexão é desenhado a partir do pool adequado, ou se necessário, é criado e adicionado ao pool adequado.",
"mssql.connection.maxPoolSize":"[Opcional] Especifica o número máximo de conexões permitidas no pool.",
"mssql.connection.minPoolSize":"[Opcional] Especifica o número mínimo de conexões permitidas no pool.",
"mssql.connection.loadBalanceTimeout":"[Opcional] Especifica a quantidade mínima de tempo em segundos para o tempo de vida desta conexão no pool antes de ser removida ou excluída.",
"mssql.connection.replication":"[Opcional] Usado pelo SQL Server na replicação.",
"mssql.connection.attachDbFilename":"[Opcional] Especifique o nome do arquivo primário, incluindo o nome de caminho completo, de um banco de dados anexável.",
"mssql.connection.failoverPartner":"[Opcional] Especifica o endereço de rede ou o nome da instância do SQL Server que atua como um parceiro de failover.",
"mssql.connection.multiSubnetFailover":"[Opcional] Quando definido como 'verdadeiro', a detecção e a conexão ao servidor ativo é mais rápido se o grupo de disponibilidade do AlwaysOn é configurado em sub-redes diferentes.",
"mssql.connection.multipleActiveResultSets":"[Opcional] Quando definido como 'verdadeiro', múltiplos conjuntos de resultados podem ser retornados e lidos na conexão.",
"mssql.connection.packetSize":"[Opcional] Especifica o tamanho em bytes dos pacotes de rede para se comunicar com o SQL Server.",
"mssql.connection.typeSystemVersion":"[Opcional] Indica qual tipo de servidor o provedor irá expor através do DataReader.",
"mssql.connection.connectionString":"[Opcional] A sequência de conexão ADO.NET a ser usada para a conexão. Substitui quaisquer outras opções desta conexão.",
"mssql.connection.profileName":"[Opcional] Especifica um nome personalizado para este perfil de conexão para facilmente navegar e pesquisar na paleta de comando do Visual Studio Code.",
"mssql.connection.savePassword":"[Opcional] Quando definido como 'verdadeiro', a senha para a autenticação SQL Server é salva no armazenamento seguro de seu sistema operacional como o KeyChain no MacOS ou Secure Store no Windows.",
"mssql.connection.emptyPasswordInput":"[Opcional] Indica se este perfil tem uma senha vazia definida explicitamente",
"mssql.shortcuts":"Atalhos relacionados à janela de resultados",
"mssql.messagesDefaultOpen":"Verdadeiro para o painel de mensagens ser aberto por padrão; falso para fechado",
"mssql.resultsFontFamily":"Definir a família de fontes para a grade de resultados; definido como em branco para usar a fonte do editor",
"mssql.resultsFontSize":"Definir o tamanho da fonte para a grade de resultados; definido como em branco para usar o tamanho do editor",
"mssql.saveAsCsv.includeHeaders":"[Opcional] Quando verdadeiro, os cabeçalhos de coluna são incluídos ao salvar os resultados como CSV",
"mssql.saveAsCsv.delimiter":"[Optional] Delimiter for separating data items when saving results as CSV",
"mssql.saveAsCsv.lineSeparator":"[Optional] Character(s) used for separating rows when saving results as CSV",
"mssql.saveAsCsv.textIdentifier":"[Optional] Character used for enclosing text fields when saving results as CSV",
"mssql.saveAsCsv.encoding":"[Optional] File encoding used when saving results as CSV",
"mssql.copyIncludeHeaders":"[Opcional] Opções de configuração para copiar os resultados da exibição de resultados",
"mssql.copyRemoveNewLine":"[Opcional] Opções de configuração para copiar os resultados de várias linhas do modo de exibição de resultados",
"mssql.showBatchTime":"[Opcional] Tempo de execução deve ser mostrado para lotes individuais",
"mssql.splitPaneSelection":"[Opcional] Opções de configuração para qual os painéis de resultados de novas colunas devem ser abertos",
"mssql.format.alignColumnDefinitionsInColumns":"Definições de coluna devem ser alinhadas?",
"mssql.format.datatypeCasing":"Tipos de dados formatados como letras MAIÚSCULAS, minúsculas, ou nenhum (não formatado)?",
"mssql.format.keywordCasing":"Palavras-chave devem ser formatados letras MAIÚSCULAS, minúsculas, ou nenhum (não formatado)?",
"mssql.format.placeCommasBeforeNextStatement":"vírgulas devem ser colocadas no início de cada instrução em uma lista? Por exemplo, ', minhacoluna2' em vez de no final, por exemplo, 'minhacoluna1,'",
"mssql.format.placeSelectStatementReferencesOnNewLine":"Referências a objetos em uma instrução select devem ser divididas em linhas separadas? Por exemplo, para 'SELECT C1, C2 FROM T1' onde C1 e C2 deverão estar em linhas separadas",
"mssql.applyLocalization":"[Opcional] Opções de configuração para localização no local configurado do VSCode (deve reiniciar o VSCode para que as configurações entrem em vigor)",
"mssql.query.displayBitAsNumber":"Colunas do tipo BIT devem ser exibidas como números (1 ou 0)? Se falso, colunas do tipo BIT serão exibidas como 'verdadeiro' ou 'falso'",
"mssql.intelliSense.enableIntelliSense":"IntelliSense deve ser habilitado?",
"mssql.intelliSense.enableErrorChecking":"Verificação de erros de IntelliSense devem ser habilitados?",
"mssql.intelliSense.enableSuggestions":"Sugestões de IntelliSense devem ser habilitados?",
"mssql.intelliSense.enableQuickInfo":"Informações rápidas de IntelliSense devem ser habilitadas?",
"mssql.intelliSense.lowerCaseSuggestions":"Sugestões de IntelliSense devem ser em letras minúsculas?",
"mssql.persistQueryResultTabs":"Should query result selections and scroll positions be saved when switching tabs (may impact performance)"
}
