{
"mssql.runQuery":"Execute Query",
"mssql.runCurrentStatement":"Execute Current Statement",
"mssql.cancelQuery":"Cancel Query",
"mssql.addObjectExplorer":"Add Connection",
"mssql.scriptSelect":"Select Top 1000",
"mssql.scriptCreate":"Script as Create",
"mssql.scriptDelete":"Script as Drop",
"mssql.scriptExecute":"Script as Execute",
"mssql.scriptAlter":"Script as Alter",
"mssql.removeObjectExplorerNode":"Remove",
"mssql.refreshObjectExplorerNode":"Refresh",
"extension.connections":"Connections",
"mssql.connect":"Connect",
"mssql.disconnect":"Disconnect",
"mssql.manageProfiles":"Manage Connection Profiles",
"mssql.chooseDatabase":"Use Database",
"mssql.chooseLanguageFlavor":"Choose SQL handler for this file",
"mssql.showGettingStarted":"Getting Started Guide",
"mssql.newQuery":"New Query",
"mssql.objectExplorerNewQuery":"New Query",
"mssql.toggleSqlCmd":"Toggle SQLCMD Mode",
"mssql.rebuildIntelliSenseCache":"Refresh IntelliSense Cache",
"mssql.logDebugInfo":"[Facoltativo] Registra l'output di debug nella console di VS Code (Aiuto -> Abilita Strumenti Sviluppo)",
"mssql.maxRecentConnections":"Il numero massimo di connessioni utilizzate di recente da memorizzare nell'elenco connessioni.",
"mssql.connections":"I profili di connessione definiti in 'Impostazioni utente' sono mostrati sotto il comando 'MS SQL: Connect'.",
"mssql.connection.server":"[Obbligatorio] Specificare il nome del server a cui connettersi. Utilizzare 'hostname\\instance' o ' <server>. database.windows.net' per Azure SQL Database.",
"mssql.connection.database":"[Facoltativo] Specificare il nome del database a cui connettersi. Se il database non è specificato, verrà utilizzata l'impostazione predefinita del database utente, tipicamente 'master'.",
"mssql.connection.user":"[Facoltativo] Specificare il nome utente per l'autenticazione di SQL Server. Se il nome utente non è specificato verrà chiesto nuovamente al momento della connessione.",
"mssql.connection.password":"[Facoltativo] Specificare la password per l'autenticazione di SQL Server. Se non è specificata o già salvata, verrà richiesta alla connessione.",
"mssql.connection.authenticationType":"[Facoltativo] Specifica il tipo di autenticazione di SQL Server.",
"mssql.connection.port":"[Facoltativo] Specificare il numero di porta a cui connettersi.",
"mssql.connection.encrypt":"[Facoltativo] Quando impostato a 'true', SQL Server utilizza la crittografia SSL per i dati inviati tra il client e il server se il server ha un certificato installato. Impostare a 'true' per le connessioni a Azure SQL Database.",
"mssql.connection.trustServerCertificate":"[Facoltativo] Quando impostato a 'true', il certificato SSL di SQL Server viene automaticamente considerato attendibile quando il livello di comunicazione è crittografato tramite SSL. Impostare 'false' per la connessione al Azure SQL Database.",
"mssql.connection.persistSecurityInfo":"[Facoltativo] Se impostato a 'false', le informazioni riservate, come ad esempio la password, non saranno restituite come parte della connessione, se la connessione è aperta o è già stata in uno stato aperto.",
"mssql.connection.connectTimeout":"[Facoltativo] Specificare l'intervallo di tempo di attesa in secondi per una connessione al server prima del timeout. Il valore di timeout predefinito per il Azure SQL Database è 30.",
"mssql.connection.connectRetryCount":"[Facoltativo] Specifica il numero di tentativi di ripristino della connessione.",
"mssql.connection.connectRetryInterval":"[Facoltativo] Specifica il tempo di attesa tra i tentativi di ripristino della connessione.",
"mssql.connection.workstationId":"[Facoltativo] Specifica il nome della workstation connessa a SQL Server.",
"mssql.connection.applicationName":"[Facoltativo] Specifica il nome dell'applicazione utilizzata da SQL Server per fare log (impostazione predefinita: 'vscode-mssql').",
"mssql.connection.applicationIntent":"[Facoltativo] Dichiara il tipo di carico di lavoro dell'applicazione quando ci si connette a SQL Server, come ReadWrite o ReadOnly. Per maggiori dettagli, fare riferimento a SQL Server AlwaysOn.",
"mssql.connection.currentLanguage":"[Facoltativo] Indica le impostazioni di lingua di SQL Server.",
"mssql.connection.pooling":"[Facoltativo] Quando impostato a 'true', l'oggetto connection viene estratto dal pool appropriato, o, se necessario, viene creato e aggiunto al pool appropriato.",
"mssql.connection.maxPoolSize":"[Facoltativo] Specifica il numero massimo di connessioni consentite nel pool.",
"mssql.connection.minPoolSize":"[Facoltativo] Specifica il numero minimo di connessioni consentite nel pool.",
"mssql.connection.loadBalanceTimeout":"[Facoltativo] Specifica la quantità minima di tempo in secondi per la persistenza della connessione nel pool prima che essa sia rimossa o eliminata.",
"mssql.connection.replication":"[Facoltativo] Utilizzato da SQL Server nella replica.",
"mssql.connection.attachDbFilename":"[Facoltativo] Specifica il nome del file primario, comprensivo di percorso completo, di un database collegabile.",
"mssql.connection.failoverPartner":"[Facoltativo] Specifica il nome o indirizzo di rete dell'istanza di SQL Server che agisce come un partner di failover.",
"mssql.connection.multiSubnetFailover":"[Facoltativo] Quando impostato a 'true', il rilevamento e la connessione al server attivo è più veloce se si configura in sottoreti diverse l'AlwaysOn Availability Group.",
"mssql.connection.multipleActiveResultSets":"[Facoltativo] Quando impostato a 'true', result set multipli possono essere restituiti e letti sulla connessione.",
"mssql.connection.packetSize":"[Facoltativo] Specifica la dimensione in byte dei pacchetti di rete per comunicare con SQL Server.",
"mssql.connection.typeSystemVersion":"[Facoltativo] Indica quale tipo di server il provider esporrà mediante l'oggetto DataReader.",
"mssql.connection.connectionString":"[Facoltativo] La stringa di connessione ADO.NET da utilizzare per la connessione. Esegue l'override di qualsiasi altra opzione impostata per la connessione.",
"mssql.connection.profileName":"[Facoltativo] Specifica un nome personalizzato di profilo di connessione per facilitare la navigazione e la ricerca nella tavolozza comandi di Visual Studio Code.",
"mssql.connection.savePassword":"[Facoltativo] Quando impostato a 'true', la password per l'autenticazione di SQL Server viene salvata nell'archivio protetto del sistema operativo come ad esempio nel portachiavi di MacOS o nel Secure Store di Windows.",
"mssql.connection.emptyPasswordInput":"[Facoltativo] Indica se questo profilo ha una password vuota impostata in modo esplicito",
"mssql.shortcuts":"Collegamenti correlati alla finestra dei risultati",
"mssql.messagesDefaultOpen":"True per aprire di default il riquadro messaggi; false per non aprirlo",
"mssql.resultsFontFamily":"Imposta la famiglia di caratteri per la griglia dei risultati; lasciare vuoto per utilizzare il font editor",
"mssql.resultsFontSize":"Imposta la dimensione del carattere per la griglia dei risultati; lasciare vuoto per utilizzare l'editor delle dimensioni",
"mssql.saveAsCsv.includeHeaders":"[Facoltativo] Quando è 'true', le intestazioni di colonna sono incluse quando si salvano i risultati come file CSV",
"mssql.saveAsCsv.delimiter":"[Optional] Delimiter for separating data items when saving results as CSV",
"mssql.saveAsCsv.lineSeparator":"[Optional] Character(s) used for separating rows when saving results as CSV",
"mssql.saveAsCsv.textIdentifier":"[Optional] Character used for enclosing text fields when saving results as CSV",
"mssql.saveAsCsv.encoding":"[Optional] File encoding used when saving results as CSV",
"mssql.copyIncludeHeaders":"[Facoltativo] Opzioni di configurazione per copiare i risultati dalla vista dei risultati",
"mssql.copyRemoveNewLine":"[Facoltativo] Opzioni di configurazione per la copia di risultati multi linea dalla vista dei risultati",
"mssql.showBatchTime":"[Facoltativo] Il tempo di esecuzione deve essere mostrato per singoli batch?",
"mssql.splitPaneSelection":"[Facoltativo] Opzioni di configurazione per determinare per quale colonna i nuovi riquadri risultato dovrebbero essere aperti",
"mssql.format.alignColumnDefinitionsInColumns":"Le definizioni di colonna devono essere allineate?",
"mssql.format.datatypeCasing":"I tipi di dato devono essere formattati come maiuscole, minuscole, o nessuno (non formattato)?",
"mssql.format.keywordCasing":"Le parole chiave devono essere formattate come maiuscole, minuscole, o nessuno (non formattato)?",
"mssql.format.placeCommasBeforeNextStatement":"Le virgole devono essere collocate all'inizio di ogni istruzione in una lista, ad esempio ', mycolumn2' anziché alla fine, ad esempio 'mycolumn1,'?",
"mssql.format.placeSelectStatementReferencesOnNewLine":"I riferimenti agli oggetti in istruzioni select dovrebbero essere suddivisi in righe separate? Ad esempio per 'SELECT C1, C2 FROM T1' sia C1 che C2 saranno su righe diverse",
"mssql.applyLocalization":"[Facoltativo] Opzioni di configurazione per la localizzazione di VSCode (è necessario riavviare VSCode per rendere le impostazioni effettive)",
"mssql.query.displayBitAsNumber":"Le colonne di tipo BIT devono essere visualizzati come numeri (1 o 0)? Se 'false', verranno visualizzate come 'true' o 'false'",
"mssql.intelliSense.enableIntelliSense":"IntelliSense deve essere abilitato?",
"mssql.intelliSense.enableErrorChecking":"Il controllo degli errori di IntelliSense deve essere abilitato?",
"mssql.intelliSense.enableSuggestions":"I suggerimenti IntelliSense devono essere abilitati?",
"mssql.intelliSense.enableQuickInfo":"Le informazioni rapide IntelliSense devono essere abilitate?",
"mssql.intelliSense.lowerCaseSuggestions":"I suggerimenti di IntelliSense devono essere in lettere minuscole?",
"mssql.persistQueryResultTabs":"Should query result selections and scroll positions be saved when switching tabs (may impact performance)"
}
