{
"mssql.runQuery":"Execute Query",
"mssql.runCurrentStatement":"Execute Current Statement",
"mssql.cancelQuery":"Cancel Query",
"mssql.addObjectExplorer":"Add Connection",
"mssql.scriptSelect":"Select Top 1000",
"mssql.scriptCreate":"Script as Create",
"mssql.scriptDelete":"Script as Drop",
"mssql.scriptExecute":"Script as Execute",
"mssql.scriptAlter":"Script as Alter",
"mssql.removeObjectExplorerNode":"Remove",
"mssql.refreshObjectExplorerNode":"Refresh",
"extension.connections":"Connections",
"mssql.connect":"Connect",
"mssql.disconnect":"Disconnect",
"mssql.manageProfiles":"Manage Connection Profiles",
"mssql.chooseDatabase":"Use Database",
"mssql.chooseLanguageFlavor":"Choose SQL handler for this file",
"mssql.showGettingStarted":"Getting Started Guide",
"mssql.newQuery":"New Query",
"mssql.objectExplorerNewQuery":"New Query",
"mssql.toggleSqlCmd":"Toggle SQLCMD Mode",
"mssql.rebuildIntelliSenseCache":"Refresh IntelliSense Cache",
"mssql.logDebugInfo":"[Opcional] Registrar los resultados de depuración a la consola de VS Code (ayuda-> Interruptor de herramientas de desarrollo)",
"mssql.maxRecentConnections":"El número máximo de conexiones recientemente utilizadas para almacenar en la lista de conexiones.",
"mssql.connections":"Los perfiles de conexión definidos en 'Configuración de usuario' se muestran bajo el comando ' MS SQL: Conect' en la paleta de comandos.",
"mssql.connection.server":"[Obligatorio] Especificar el nombre del servidor para conectarse. Utilizar 'nombredehost\\instancia' o '<server>.database.windows.net' para una base de datos de SQL Azure.",
"mssql.connection.database":"[Opcional] Especifique el nombre de la base de datos para conectarse. Si no se especifica la base de datos, se utiliza la configuración de la base de datos de usuario predeterminada, típicamente 'master'.",
"mssql.connection.user":"[Opcional] Especifique el nombre de usuario para la autenticación de SQL Server. Si no se especifica nombre de usuario, cuando se conecte se le pedirá otra vez.",
"mssql.connection.password":"[Opcional] Especifique la contraseña para la autenticación de SQL Server. Si la contraseña no se especifica o ya está guarda, cuando se conecte se le pedirá otra vez.",
"mssql.connection.authenticationType":"Especifica el tipo de autenticación para SQL Server.",
"mssql.connection.port":"[Opcional] Especificar el número de puerto para conectarse.",
"mssql.connection.encrypt":"[Opcional] Cuando está establecido en 'true', SQL Server utiliza encriptación SSL para los datos enviados entre el cliente y el servidor si el servidor tiene un certificado instalado. Establecer 'true' para la conexión de base de datos de SQL Azure.",
"mssql.connection.trustServerCertificate":"[Opcional] Cuando está establecido en 'true', el certificado SSL del servidor SQL es automáticamente considerado de confianza cuando la capa de la comunicación está cifrada mediante SSL. Configurar como 'false' para la conexión de base de datos de SQL Azure.",
"mssql.connection.persistSecurityInfo":"[Opcional] Cuando se establece como 'false', la información crítica respecto a la seguridad, como la contraseña, no se devuelve como parte de la conexión si la conexión está abierta o alguna vez ha estado en un estado abierto.",
"mssql.connection.connectTimeout":"[Opcional] Especificar la cantidad de tiempo en segundos durante la que se espera una conexión al servidor antes de que caduque el tiempo de espera. El valor de tiempo de espera predeterminado para la base de datos de SQL Azure es 30.",
"mssql.connection.connectRetryCount":"[Opcional] Especificar el número de intentos para restablecer la conexión.",
"mssql.connection.connectRetryInterval":"[Opcional] Especifique el retardo entre intentos de restablecer la conexión.",
"mssql.connection.workstationId":"[Opcional] Especifique el nombre de la estación de trabajo que se conecta a SQL Server.",
"mssql.connection.applicationName":"[Opcional] Especifique el nombre de la aplicación utilizada por SQL.",
"mssql.connection.applicationIntent":"[Opcional] Declara el tipo de carga de trabajo de aplicación cuando se conecta a SQL Server tal como ReadWrite o ReadOnly. Para más detalles, consulte SQL Server AlwaysOn.",
"mssql.connection.currentLanguage":"[Opcional] Indica la configuración de idioma de SQL Server.",
"mssql.connection.pooling":"[Opcional] Cuando está establecido en 'true', el objeto connection se extrae del grupo de conexiones adecuado o, si es necesario, se crea y se agrega al grupo apropiado.",
"mssql.connection.maxPoolSize":"[Opcional] Especificar el número máximo de conexiones permitidas en el grupo de conexiones.",
"mssql.connection.minPoolSize":"[Opcional] Especificar el número mínimo de conexiones permitidas en el grupo de conexiones.",
"mssql.connection.loadBalanceTimeout":"[Opcional] Especificar la cantidad mínima de tiempo de vida de la conexión dentro del grupo, en segundos, antes de ser eliminada o borrada.",
"mssql.connection.replication":"[Opcional] Utilizada por SQL Server en la replicación.",
"mssql.connection.attachDbFilename":"[Opcional] Especifique el nombre del archivo principal, incluyendo la ruta de acceso completa, de una base de datos adjuntable.",
"mssql.connection.failoverPartner":"[Opcional] Especificar el nombre o dirección de red de la instancia de SQL Server que actúa como socio de conmutación por error.",
"mssql.connection.multiSubnetFailover":"[Opcional] Cuando se establece en 'true', la detección y conexión con el servidor activo es más rápida si el grupo de disponibilidad de AlwaysOn está configurado en diferentes subredes.",
"mssql.connection.multipleActiveResultSets":"[Opcional] Cuando se establece en 'true', se pueden devolver y leer múltiples conjuntos de resultados a través de la conexión.",
"mssql.connection.packetSize":"[Opcional] Especifique el tamaño en bytes de los paquetes de red para comunicarse con SQL Server.",
"mssql.connection.typeSystemVersion":"[Opcional] Indica qué tipo de servidor expondrá el proveedor a través del DataReader.",
"mssql.connection.connectionString":"[Opcional] La cadena de conexión ADO.NET que se utilizará para la conexión. Reemplaza cualesquiera otras opciones establecidas en esta conexión.",
"mssql.connection.profileName":"[Opcional] Especificar un nombre personalizado para este perfil de conexión para navegar fácilmente y buscar en la paleta de comandos de Visual Studio Code.",
"mssql.connection.savePassword":"[Opcional] Cuando se establece en 'true', la contraseña para autenticación de SQL Server se guarda en el almacén seguro de su sistema operativo tal como KeyChain en MacOS o Secure Store en Windows.",
"mssql.connection.emptyPasswordInput":"[Opcional] Indica si este perfil tiene una contraseña vacía establecida explícitamente",
"mssql.shortcuts":"Accesos directos relacionados con la ventana de resultados",
"mssql.messagesDefaultOpen":"True para que el panel de mensajes esté abierto de forma predeterminada; false para que esté cerrado",
"mssql.resultsFontFamily":"Establece la familia de fuentes para la grilla de resultados; dejarlo en blanco para usar la fuente del editor",
"mssql.resultsFontSize":"Establecer el tamaño de fuente para la grilla de resultados; Dejar en blanco para utilizar el tamaño del editor",
"mssql.saveAsCsv.includeHeaders":"[Opcional] Cuando se esteblece en true, los encabezados de columna se incluyen al guardar resultados como CSV",
"mssql.saveAsCsv.delimiter":"[Optional] Delimiter for separating data items when saving results as CSV",
"mssql.saveAsCsv.lineSeparator":"[Optional] Character(s) used for separating rows when saving results as CSV",
"mssql.saveAsCsv.textIdentifier":"[Optional] Character used for enclosing text fields when saving results as CSV",
"mssql.saveAsCsv.encoding":"[Optional] File encoding used when saving results as CSV",
"mssql.copyIncludeHeaders":"[Opcional] Opciones de configuración para copiar resultados desde la vista de resultados",
"mssql.copyRemoveNewLine":"[Opcional] Opciones de configuración para copiar resultados de varias líneas desde la vista de resultados",
"mssql.showBatchTime":"[Opcional] Si el tiempo de ejecución se mostrará para lotes individuales",
"mssql.splitPaneSelection":"[Opcional] Opciones de configuración para en cual columna se deben abrir los nuevos páneles de resultados",
"mssql.format.alignColumnDefinitionsInColumns":"¿Se deben alinear las definiciones de columna?",
"mssql.format.datatypeCasing":"Los tipos de dato deben ser formateados como MAYÚSCULAS, minúsculas, o ninguno (sin formato)",
"mssql.format.keywordCasing":"Las palabras clave deben tener formato como MAYÚSCULAS, minúsculas, o ninguno (sin formato)",
"mssql.format.placeCommasBeforeNextStatement":"Las comas deben colocarse al principio de cada frase en una lista por ejemplo, ', mycolumn2' en vez de al final por ejemplo, 'mycolumn1',",
"mssql.format.placeSelectStatementReferencesOnNewLine":"¿Deben dividirse las referencias a objetos en en sentencias select en líneas separadas? Por ejemplo, para 'SELECT C1, C2 FROM T1' C1 y C2 estarán en líneas separadas",
"mssql.applyLocalization":"[Opcional] Opciones de configuración para localización en la configuración regional configurada en VSCode (debe reiniciar VSCode para que la configuración surta efecto)",
"mssql.query.displayBitAsNumber":"¿Se deben mostrar las columnas BIT como números (1 o 0)? Si es false, las columnas BIT se mostrarán como 'true' o 'false'",
"mssql.intelliSense.enableIntelliSense":"Debe habilitar IntelliSense",
"mssql.intelliSense.enableErrorChecking":"Debe habilitar la comprobación de errores de IntelliSense ",
"mssql.intelliSense.enableSuggestions":"Debe habilitar las sugerencias de IntelliSense",
"mssql.intelliSense.enableQuickInfo":"Debe habilitar la información rápida de IntelliSense",
"mssql.intelliSense.lowerCaseSuggestions":"Las sugerencias de IntelliSense debe estar en minúsculas",
"mssql.persistQueryResultTabs":"Should query result selections and scroll positions be saved when switching tabs (may impact performance)"
}
